{
    "favourites": {
        "counts": {
            "0": 0,
            "1-9": 0,
            "10-19": 0,
            "20-29": 0,
            "30-39": 0,
            "40-49": 0,
            "50-99": 0,
            "100-199": 0,
            "200+": 0
        }
    },
    "proposals": {
        "accepted": [
            {
                "published_title": "How I found a Roman Villa (or temple)",
                "published_description": "The Roman archaeological record is far from complete; There are hundreds of high status Roman buildings yet to be located in Britain. \r\n\r\nI was volunteering in the ambulance service during COVID when I was given a piece of Roman pottery by a patient. With no training (I later embarked on an Archaeology degree ), I started to carefully investigate and record what is now established as an enigmatic high-status Roman building - complete with mosaic, painted wall plaster and hypocaust. \r\n\r\nMy talk will demonstrate some free Web-based tools that you can use to investigate your local landscape (LiDAR, etc.). It will also show you non-invasive ways to survey and record archaeological sites. Finally, I'll have some Roman artefacts to handle.\r\n\r\n\r\n",
                "names": "Jo Skerry",
                "pronouns": "She/Her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 17:20:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "CHERI and Arm Morello: mitigating the terrible legacy of memory-safety security issues, in practice at scale",
                "published_description": "Computing is riddled with security vulnerabilities, many of which arise from memory safety issues.  Conventional hardware architectures and the C/C++ codebase are chronically prone to exploitable errors - a 75-year-old problem at the heart of computing.  \r\n\r\nThis talk will introduce CHERI, showing how (finally?!) we can do better.  The CHERI research project has developed a new architecture+software approach, using unforgeable hardware capabilities to implement pointers. Morello is an Arm experimental platform for evaluation of CHERI to explore its potential for mass-market adoption, part-funded by the UKRI Digital Security by Design programme, and other groups are developing CHERI-enabled RISC-V processors, including Microsoft, Google, lowRISC, SCI Semiconductor, Codasip, and RISC-V International. \r\n\r\nThis talk will introduce the problem, and CHERI and Morello, for a broad audience: the hardware extensions, their potential for fine-grained memory safety and software compartmentalisation, the CHERI software stack, and machine-checked mathematical proof that the architecture design provides the intended security. CHERI complements alternative high-level-language approaches, that would need code to be rewritten from scratch, and we'll talk about the often-low cost of porting code to CHERI. \r\n\r\nI'll demo how CHERI prevents exploitable memory safety errors on a Morello box,  running Arm CHERI hardware and a complete CHERI software stack.\r\n\r\nThis is joint work by the CHERI and Morello teams at the University of Cambridge, Arm, SRI International, and the University of Edinburgh. ",
                "names": "Peter Sewell",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 17:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Endocrine Biohacking - Friends of Blåhaj and beyond",
                "published_description": "Biohacking for girls, gays, theys, and undisclosed entitites.\r\n\r\nWhy biohacking is good, cool, and a human right\r\nA brief history of biohacking and why endocrine biohacking is so cool\r\nhow to manage your own endocrine care\r\nhow to access managed endocrine care\r\nsafe sourcing of international pharmaceuticals\r\nalternative routes of care (and modelling risk)",
                "names": "a[gk]i|ab+y",
                "pronouns": "She/They",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-05-31 13:10:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "I FOI'd every NHS board in England on autism assessment provision: here's how it went",
                "published_description": "In December 2023, 172,022 people were waiting for an autism assessment. We know this because NHS England publish quarterly national and regional statistics on the size of the waiting list. What we *don't* know is how long they're waiting for, how many ultimately get a diagnosis, what the referral process is like, or what support (if any) is given afterwards - all of which is a postcode lottery.\r\n\r\nI lead policy at Autistica, the UK's leading autism research and campaigning charity. I am also autistic myself, which sometimes manifests as a chronic inability to give up. That's why, on 14th March, I sent the same Freedom of Information Act request to all 42 NHS Integrated Care Boards in England.\r\n\r\nWhat started as firing off a few e-mails turned very complicated very quickly; this is a whistle-stop tour of redirection, confusion, and private outsourcing. Over eleven weeks on, I *hope* I'll be able to present a national overview of the growing crisis facing autistic people and their loved ones - and what we need to do about it.",
                "names": "Georgia Harper",
                "pronouns": "She/Her",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-06-02 10:40:00",
                "scheduled_duration": 20,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "When a tree falls in the forest.... does it cause a fire?",
                "published_description": "Overstory uses satellite imagery plus machine learning to understand individual trees - at scale. I'll talk about how we do this, some of the practical challenges of remote sensing and earth observation, and how we translate this into real world prevention of wildfire and power outage by working with utilities, who manage many thousands of miles of power cables. ",
                "names": "Laura James",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 19:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Writing computer code by voice",
                "published_description": "What does a computer programmer do if they can’t type code? Speak it, of course!\r\n\r\nLike many programmers and heavy computer users, I suffer from chronic hand pain aggravated by computer keyboard use (often called repetitive strain injury, or RSI). After having mild symptoms for years, in 2019 my hand pain worsened from irritating to unignorable. Eventually I got desperate enough to try to learn to code by voice. To my surprise, it worked.\r\n\r\nSpeech recognition technology has advanced dramatically in the past decade, but most people’s ideas about voice-driven UI are based on highly limited voice assistants like Siri or Alexa, powerful but imprecise tools like LLMs, or special-purpose dictation tools. What does a voice interface for precise control by expert users look like?\r\n\r\nA small but growing community of programmers, many affected by RSI, have been developing tools that explore this question. I use one such tool, called Talon, to control my computer, write and edit computer code, and even to write my dissertation. In this talk, I will live-demo how I edit code by voice, as well as tackling the following questions:\r\n\r\n1. What is voice-coding like? What unique challenges does it present?\r\n2. How do voice control systems like Talon work under the hood?\r\n3. Could voice coding ever be *better* than typing?\r\n4. What can we learn from all this about designing voice interfaces for expert users?",
                "names": "Michael Arntzenius",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 11:10:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "unexpected coffee: a dive into industrial coffee machines",
                "published_description": "A bit more than two years ago, someone contacted our Hackspace asking if we would be interested in an electronically defective, but probably repairable industrial coffee vending machine. An industrial coffee machine with a touchscreen and cocoa toppings? No idea where we would find enough room for it or if it would actually be used, but of course we'd be interested! \r\nAfter a few months of collecting (additional) dust and annoying a few members, we started the quest to get this machine back to work and to explore the (questionable) world of industrial coffee vending legacy, from hardware, over electronics to software architecture. \r\n\r\nThis is a talk about how we repaired the machine, how these machines usually work, a dive into legacy software and electronics setups, and why those coffee vending machines taste like they do.\r\nLast but not least, we will discuss how we started to reverse engineer the internal system communication and if we would award a hackvalue of over 9000 for this type of machines.\r\n\r\nThere is also the final question: does it run Doom?\r\n",
                "names": "Hetti",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 17:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Unlimited Power: An Engineer's Low-Down on Nuclear Fusion Technology",
                "published_description": "Most technical people hear about fusion power in the news or see it in games and movies, and are familiar with the joke that it's always 20 years away. Beyond this, it's surprisingly rare to find good information beyond the basic physics and the marketing promise of unlimited, clean energy.\r\n\r\nAs an engineer working in the fusion technology sector, I give a primer on how fusion power works, why its benefits are so incredibly tantalising yet hard to achieve, what the latest exciting developments are, and how the UK is a surprising trailblazer. I outline some of the cutting-edge technologies involved in developing fusion power, including superconducting magnets, plasma control using deep learning methods, and hypersonic fuel injection. The audience is also given facts and figures to get a flavour of the unimaginable scale of what is being done: materials at nearly 0K adjacent to plasmas hotter than the cores of stars, gigawatts of power from teaspoons of fuel, magnetic fields multiple times more powerful than MRI machines, and neutron fluxes strong enough to transmute matter in bulk.\r\n\r\nComing away from this presentation, the audience will have learned about the fundamentals of nuclear fusion and appreciate the key issues enough to put the marketing and news reports into context. They might even be excited and enthused about what's to come in this quickly growing technology space.",
                "names": "James Pope",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 16:10:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Sending text messages through space",
                "published_description": "When we’re out and about, text messages (and also voice calls, mobile data etc.) sent and received through our everyday smartphones are all routed through fixed land-based ‘cell tower’ antennas no more than a few km distant, which form what we might term a ‘Terrestrial Network’ (TN). In rural areas, we often lose cellular wireless signal entirely, even within highly technologically advanced economies such as the UK, EU, US etc. We then find that we are unable to send or receive text messages, even emergency messages. \r\n\r\nIn the 1990s, visionary scientists and engineers developed alternative voice and messaging systems, using satellites as their ‘flying’ cell towers. We will discuss an example of such a pioneering network, called Iridium, which has operated successfully from the late 1990s right up to the present day. Today’s scientist and engineer visionaries are now proposing that the same ‘space-based’ capabilities could be added to our everyday smartphones, without needing to purchase a separate satellite-messaging device. This would allow our phone, when necessary, to switch from the land-based TN to the space-based ‘Non-Terrestrial Network’ (NTN). In this presentation we will discuss some of the technical challenges in achieving this ‘Direct-to-Device’ (D2D) satellite messaging feature, and some of the solutions which are being proposed, and even already being tested for real. One of the leading players in this space is Starlink, so buckle up for a wild ride!",
                "names": "Damian Bevan",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "What the Frack? The inside view of unconventional oil production.",
                "published_description": "Few things are as polarizing today as the production of oil, and unconventional production (including 'fracking') is even more controversial. Whether you're for it or (more likely) against it, it's well worth knowing what is actually involved in making it happen and where the real risks are.\r\n\r\nThe presenter recently left a long career in the US oil industry and will give you a view into this world without any spin or agenda and instead give you the opportunity to deepen your understanding of what it's really all about. What is 'unconventional oil'? What does the process to produce it look like on the ground? What equipment is used? What are the real environmental impacts (beyond climate change)? Whether you want to geek out about heavy equipment or to become a more-educated protester, you'll learn something new.",
                "names": "John Thurmond",
                "pronouns": "he/him",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-05-31 18:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "OGRE tech and off-grid living",
                "published_description": "A talk looking at Off-Grid Renewable Energy technology and off-grid living.  \r\n\r\nThis presentation is based on 20 years of off-grid living experience and showcases case studies from an off-grid eco-village from 2000 to 2018.  \r\n\r\nThe talk aims to share some of the knowledge gained and look into the possibilities for future renewable off-grid living opportunities and how new technologies might be used to improve convenience and efficiency.  Topics covered will include the practical basics of harvesting, storing and using renewable energy as efficiently as possible, new ideas and practical examples, micro-hydro, solar, wind-power, batteries, electrics and wiring, efficiency, smart-micro-grids, renewables and more......",
                "names": "Merlin Howse",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Geber, Newton, Thoth: What Alchemy Tells Us About Modern Science",
                "published_description": "Alchemy is a misunderstood art. From Hellenistic Egypt through to the modern day, the story of alchemical science teaches us about how science has changed in the last 2000 years and how it has stayed the same. The influence of this ancient science resonates through our modern world in scientific theory, misconceptions and popular culture. Learn how ancient alchemists formed accurate predictive models of the material world around them, How the Victorians lied to you and possibly even the secret to making gold.",
                "names": "🐐",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 15:50:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Bringing Any Super 8 Camera Into The Digital Age",
                "published_description": "This talk will describe the development process for a digital cartridge to fit any Super 8 home movie camera without any modifications required.\r\n\r\nThere are a huge number of unused 8mm home movie cameras that have been languishing unloved for the last four decades since their owners were seduced by videotape. Many of them are built to a rather high quality, and best of all, they can still be found for not a lot of money.\r\n\r\nYou can still buy the film, and it's a lot of fun shooting a real movie, but it's not cheap. Wouldn't it be great if you could drop in a digital cartridge instead for modern day digital video with a retro feel! This project started in early 2023, and this will be its first outing in front of a live audience.",
                "names": "Jenny List",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 11:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Women Vs Hollywood",
                "published_description": "Why, given that 50% of screenwriters in the silent era were women and that there were quite a few female directors and producers, did women get pushed out of filmmaking and never really come back? What happened in the studio era, and why has nothing changed in all the waves of forward movement since? Why, today, do the number of female directors hover around the 10% mark, even after #MeToo and #TimesUp? Female A-list stars still earn only about half as much as their male counterparts, partly because only about 12% of leading roles go to women. Films made by or for women get smaller budgets, smaller releases and smaller marketing spend than male-made equivalents, and the picture is much, much worse for women of colour. So why is this and how do we change things? And why is Barbie such an important step forward?",
                "names": "Helen O'Hara",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 16:20:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Hack The Plan: How I Made a Career out of Not Knowing What I Want To Be When I Grow Up.",
                "published_description": "\"So what do you do?\"\r\n\r\nEverything.\r\n\r\n──────────\r\n\r\nAs a kid I couldn't decide what I wanted to be when I grew up.\r\n\r\nI still can't, but over the past twenty years I've turned that into a superpower.\r\n\r\nIn this talk I'll tell you how I hacked the idea of a standard career and managed to combine skills from different fields and specialties, leading to some unique roles and opportunities.\r\n\r\nIf you love learning and constantly adding new tools to your intellectual toolkit, you’ll find that being a 'nerd of all trades' is not just fun—it’s the best way to live. The only downside? When someone asks \"so what do you do\" at parties, you'll never quite know what to say!\r\n\r\n",
                "names": "Kestral Gaian",
                "pronouns": "They/Them",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 14:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Field-FX: Digital art, Demos and Prizegiving",
                "published_description": "Music and animation, art and code, all come together in a demoscene tradition with a history of over 40 years. It's generative art, storytelling, creative coding and more, with contributors of diverse skill levels from across the globe. We're having a party on Saturday night, and we're going to have a prizegiving ceremony and recap of the winning entries on stage on Sunday. Prepare to be awed!\r\n\r\nYou can take part too! Check out field-fx.party online to find out how.",
                "names": "Reality Crossley, Alex Shaw ",
                "pronouns": "they/them, they/them",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 18:00:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Rocket Science For Teenagers",
                "published_description": "Model rocketry is great fun and an excellent way to get young people interested in science and engineering.\r\n\r\nIn 2022 and 2023 I mentored a team of 3 teenagers to enter UKROC, the UK youth rocketry challenge. The team had to design and build a rocket to take a raw egg to 250m and return it to the ground in 45 seconds, without breaking the egg. \r\n\r\nThe team went in 2 years from not knowing much to (spoiler alert) winning UKROC and then the International championship at the Paris Airshow.\r\n\r\nI will talk about the basics of model rocketry (physics, engineering, legal, financial, safety etc), what is involved in entering UKROC, our experiences and how you can get involved in the next UKROC competition. ",
                "names": "Andy Brice",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 17:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Steaming into Sustainability",
                "published_description": "How do you get several three storey Cornish beam engines, a collection of Grade I listed buildings and a whole network of steam infrastructure on the path towards net zero? This talk is the experience of a volunteer on the practical challenges met whilst helping the London Museum of Water and Steam with several major projects.\r\n\r\nExpect tales of reverse engineering boiler control system ladder logic, interfacing raspberryPis to 100psi steam lines and working out the water/gas/steam usage to run 200-year old steam water pumps.",
                "names": "Ben Hussey",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 14:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "How to move an industry through influence",
                "published_description": "Kubernetes has had a rapid ascent to default cloud infrastructure.  However, this didn’t happen simply because Google open sourced it.  This talk will share the messy human side of the community architecture and how that investment has paid dividends in bringing more under represented minorities into open source leadership.  \r\n\r\nI’ll offer tips and tricks to intentionally manage humans when you have no authority.  you can also expect some of the more complicated situations explosive growth combined with emergent organizing can lead to when governed by those who show up.\r\n\r\n",
                "names": "Sarah Novotny",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 14:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Revolution and Climax Q&A",
                "published_description": "A short Q&A with the creator of the Revolution and Climax machines in the arcade and bar, Tim Hunkin. ",
                "names": "Tim Hunkin",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-02 10:30:00",
                "scheduled_duration": 30,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Lunar Lander: meet the maker, drop in session",
                "published_description": "This will be a drop in event where Iain will have the front of the Lunar Lander game removed so that the mechanics are visible and will answer any questions you might have about it. ",
                "names": "Iain Sharp",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 13:30:00",
                "scheduled_duration": 60,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "ustwo games; Monument Valley 2, Alba: A Wildlife Adventure, Assemble With Care",
                "published_description": "A short demonstration and Q&A of the games in the arcade from ustwo games. \r\nMonument Valley 2\r\nAlba: A Wildlife Adventure\r\nAssemble With Care",
                "names": "Jennifer Estaris",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 11:00:00",
                "scheduled_duration": 30,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Where is the Art? Pen plotters and the history of computer art",
                "published_description": "In October 1971, Frieder Nake published an article in Page, the Bulletin of the Computer Arts Society, entitled \"There Should Be No Computer Art\", making the point that there were more important things for humans to work on together in the late Twentieth Century, than whether or not a computer should be allowed to make \"art\". \r\n\r\nIn this talk, we'll take a journey together to look at one aspect of computer history - creative technology and art - and the ways in which it has been misunderstood and feared at different points in our shared history and culture. Along the way, you'll also hear about how I accidentally became an artist, after being laid off from my dream job with big tech; the story of building my own pen plotters; and, how you can make your own army of art robots!",
                "names": "Andy Piper",
                "pronouns": "he/they",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 11:10:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Johan Peitz' PICO-8 Arcade Game Bonanza",
                "published_description": "Come meet the developer behind the quirky arcade games all made in PICO-8! This will be a short Q&A session. ",
                "names": "Johan Peitz",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 14:15:00",
                "scheduled_duration": 30,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Teletype Colossal Cave Adventure",
                "published_description": "Meet the restorer of the fantastic Teletype Model 33 that plays Colossal Cave Adventure in the arcade! Malcolm will give a short talk and demonstration and then answer any questions you might have about the machine. ",
                "names": "Malcolm Clark",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 16:00:00",
                "scheduled_duration": 60,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "PowerPoint Karaoke (retro style)",
                "published_description": "GPT PowerPoint Karaoke in 2022 was a hit — but also GPT was toooooo good at generating the topics. Let’s go retro: HR training manuals, overhead transparencies, terrible diagrams from 1970s Open University TV programmes, and random photographs. Then we make people from the audience give talks on subjects they don’t know about with slides they’ve never seen. ",
                "names": "Kate Devlin & Adam Froggatt",
                "pronouns": "She/her for Kate ",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 18:30:00",
                "scheduled_duration": 50,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Small Town, Big Ideas - The challenges of building a rural Makerspace",
                "published_description": "It turns out that building a Hackspace in a rural area is really hard.\r\n\r\nFrom the name of the group causing security concerns to finding a venue and members, a lot of the challenges that are presented in rural environments don't really seem to be present in the cities where hackspaces are most frequently found.\r\n\r\nIn this talk, I'll go over the challenges I've faced in building a Hackspace in a rural town and hopefully show how others can avoid the same pitfalls!",
                "names": "Matthew Macdonald-Wallace",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 12:20:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "GPS time, leap seconds, and a clock that's always right",
                "published_description": "It sounds easy enough: build a clock that always shows the correct local time, no matter where you take it. Mobile phones can sort-of do this, but they manage by listening to the cell towers, so this won't work everywhere. \"Radio controlled\" clocks just listen to a low frequency broadcast, there's a few different transmissions across the world but they're incompatible and know nothing of time zones. Desktop computers can use the internet for time, but you still have to tell it what zone you're in.\r\n\r\nReally, it should be possible to build a clock with nothing more than a GPS receiver, which figures out the time on its own, with no need for internet or cellular connection. It turns out that doing this requires an on-board world atlas, a spherical coordinate point-in-polygon algorithm, and a complete database of offsets and daylight savings rules.\r\n\r\nI finally created a clock that automatically corrects itself as you carry it across country and timezone borders. The journey to this point was so ridiculously tedious that it borders on the absurd. In this talk I'll run through some of the highlights, and of course no talk about GPS time would be complete without mentioning leap seconds, which cause problems even when they don't happen.",
                "names": "Tim Jacobs",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 13:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "A country you can't put in a box.",
                "published_description": "A talk about the difficulties of geospatial analysis when the country you are interested is on the edge of the world map. We'll go over some background before showing what happens when you try and draw a box around this country and the issues this causes everyone from blury satellite views to navigation failing. And why it happens.\r\n\r\nThe east and west edge of the classic Eurocentric world map, with the prime meridian down the middle, are both the same place, this causes some interesting effects.",
                "names": "Emily Selwood",
                "pronouns": "She/Her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 16:50:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "So You Want To Hack On Rail Data: What's out there, and what can you do with it?",
                "published_description": "The British rail industry publishes a lot of open data: there's at least 18 distinct data sources, plus the ones I'm forgetting. This'll be a whirlwind tour of most or all of those sources, with a view at helping people who would be interested in playing with train data but don't know where to start. You'll (hopefully) leave with some ideas for what you could build (if you didn't already have some), know what data sources you'd need, and have enough context to understand those sources' documentation. I will assume software experience (ie there'll be slides with JSON, XML, and various less pleasant things) but not rail experience. ",
                "names": "Gaelan Steele",
                "pronouns": "she/her",
                "may_record": false,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 15:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "The coffee fix: Why it's so hard to pull a great espresso, and how to improve your shots",
                "published_description": "Pulling a shot of espresso sounds so simple - just pump some water through a bed of coffee grounds. But while it sounds simple, many things can go wrong. What ends up in the cup can too easily end up bitter, sour, watery, chalky, harsh, or flat.\r\n\r\nSo how can you be an espresso alchemist, and convert your bitter shots into gold?\r\n\r\nIn this talk, I'll cover the anatomy of what goes on during coffee extraction, and the problems that can lead to bad flavoured coffee. I'll also give a whirlwind tour of the different coffee machines, equipment, and hacks that are designed to make better espresso - both the high-value gadets and the duds. You'll learn how to 'dial in' a shot to prevent it being too sour or bitter, and what steps you can take to maximise deliciousness! ",
                "names": "Damian Bramanis",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 15:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "The Auto Plane Spotter: a robot to point at aeroplanes",
                "published_description": "As a semi-professional plane spotter when I hear or see an aircraft fly over I will sometimes point at it. But I can't always tell if there's an aircraft flying over, and I can't be awake 24/7 so I miss some, which I find unacceptable. \r\n\r\nEnter the auto spotter, a robot that is capable of pointing at the nearest aircraft continuously.\r\n\r\nThe auto spotter uses 1090Mhz ADS-B Out transmissions to work out where the nearest aircraft is relative to its location and works out the bearing and elevation for a pointer. This is the same public data that is used to feed flight information services and can be received by anyone with the right (relatively cheap) equipment; all commercial and many general aviation aircraft around the world use it to transmit their positions, speeds, altitudes and more.\r\nYou may have seen the pointer at EMF2022 (in between rain showers) and this talk goes into some of the details of how it was developed, and how it works.",
                "names": "Chris Lynas",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 18:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Practicalities of being a walking lightshow",
                "published_description": "Festooning your clothes or costume with lots of glowy lights is fun. Making the glowy lights survive hours or days on end of dancing in sweaty raves or muddy festivals is harder. In this talk I discuss several ways of being a walking lightshow, the unfortunate lessons I learned over years of trying them out in the real world, and some attempts at avoiding these failures in future.\r\n\r\n[Specifically I will cover: chemiluminescence, electroluminescence, UV reactive materials, LEDs, things to consider when making light-up clothing, surprise 100v shocks and how to avoid them, and how to cheat at syncing to the music.]",
                "names": "doop",
                "pronouns": "they/them",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 10:40:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "OMG WTF SSO: A beginner's guide to Single Sign-On (mis)configuration",
                "published_description": "Single Sign-On (SSO) is sold as a way to\r\n•\tcentralize managing your organization’s users,\r\n•\tmake life easier for your colleagues, and\r\n•\tenforce consistent security standards.\r\nBut SSO protocols are just ways for an identity provider to share information about an authenticated identity with another service. Me having a way to tell my vendor “yeah, that’s Bob” doesn’t tell me what the vendor does with this information, or if the vendor always asks me who’s coming in the door.\r\nA bad SSO implementation can make you think you’re safer, while hiding all the new and fun things that have gone wrong.\r\nTo get the most out of implementing SSO, I need to know what I’m trying to accomplish and what steps I need to follow to get there. To illustrate why SSO needs to be set up carefully, for each of the things you need to do right, I’ll give you some fun examples of creative ways you and your vendor can do this wrong. We all learn from failure, right???\r\nI’m sharing this info because this year I got deeply involved in the SSO setup for several vendors at work. It turns out that I’m good at asking weird questions, and it’s an extremely valuable thing to do. If you know how things should be, then you know where they could be broken, and you can ask your vendors (and your colleagues!) “weird questions” before an adversary does.\r\n",
                "names": "Adina Bogert-O'Brien",
                "pronouns": "They/them",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 10:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Up - A Scientist's Guide to the Magic Above Us",
                "published_description": "Find joys hidden in plain sight - explore a slice taken from the surface of the Earth up into distant space and discover what we can see. From the glow of a glow-worm to the fuzzy smudge of a distant galaxy, learn where to look and also understand the science behind the phenomena. By the end of this talk you'll know where to look in the air, sky and in space to see murmurations, rainbows and shooting stars and why they cause us to stand and stare.",
                "names": "Dr Lucy Rogers",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 19:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Gas boilers suck! Hack yours today, save money, save the planet! ",
                "published_description": "Gas boilers, almost all homes in the UK have them, but they are dreadful!\r\n+90% of the ones I've seen are badly spec'ed and horribly configured, so they burn way too much gas.\r\nThen Martin Lewis keeps telling us to \"lower the flow temperature\" but it's never really explained how to, or what this does to save gas (and money). \r\n\r\nWell have I got a Slide Deck for you!!\r\n\r\nAs with any serious problem, it needs hard data. So I wired my Raspberry Pi home server to my central heating controls, wrote a bunch of code, and spent last winter collecting data from my boiler, a dozen temperature sensors, some humidity sensors and the Octopus Energy API.\r\n\r\nI have pretty graphs to show what happens all around my home, how altering the flow temperature works, how altering set points work, why my house was too cold, then too hot, and used way too much gas. \r\nI'll explain the (simple) physics and how to tweak your system for best performance too. \r\n\r\nBut ultimately, we all have to stop burning gas and move to heat pumps, a solution not understood by many and requiring something of a mind shift from the way gas central heating has always worked. I'll explain how heat pumps work and what you can do to prepare for their arrival in your home.\r\n\r\nThe future is bright, and it's heading rapidly in this direction.",
                "names": "Lee V",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 11:20:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "How to Save a Life",
                "published_description": "You, Eleanor Shellstrop, are dead. You are in cardiac arrest. Your heart has stopped beating, you have stopped breathing, and medically speaking you have died. Not a great start to your day! But worry not: someone has called 999. This talk is the story of that 999 call.\r\n\r\nThis talk, presented by the CAD & Technical Lead at the London Ambulance Service, will describe everything that happens between dialling 999 and getting to hospital, and all of the technology involved in triaging the call, dispatching the ambulance, and helping patients over the phone before it arrives. This isn't a heartwarming human-interest story from the documentaries — this is the full ins and outs of all the systems, processes, and infrastructure that keeps people safe across a major city every day. We'll explore how we use open data to find exactly where you are, exactly how we decide who gets help quickest and who must wait, and how your phone can help save your life. We'll also look at what happens when it all goes wrong, and how we respond to business continuity incidents — after all, we can't just shut up shop if the system goes down.\r\n\r\nExpect high-level conversations about medical emergencies, but this talk is suitable for all ages.",
                "names": "Skylar MacDonald",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 14:40:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "How volunteers built and are now operating Hydro Power generation on the Thames",
                "published_description": "This is the story of Reading Hydro, how a group of volunteers built and are now operating a hydro generation plant on the Thames in Reading. From raising the £1.2M to the parts build by volunteers, and how they are now operating the plant. ",
                "names": "Stuart Ward",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 10:40:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Girls Just Wanna Play Games (and be represented in them)",
                "published_description": "This talk will take you through a short history of female protagonists in video games, my experience as a female-perceived person playing games, including how this affects my interactions with others, and will finally look at some research to see the theories behind this, as well as some ideas for how we can make sure video games are for everyone.  ",
                "names": "Lauren Winter",
                "pronouns": "they/she",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 18:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Don't be evil by accident: algorithmic harms and ethics for technologists",
                "published_description": "Technologists are wizards. Today, we wield the power to effect changes from a tent, a bedroom or an office the likes of which fifty years ago one might need the power of a small nation-state to accomplish.\r\n\r\nHaving seen these systems from all angles - building the tech, researching digital consent academically, and fighting biased public sector algorithms in the media and the courts - I'm confident that we really haven’t adapted to that reality. In the choices we make in technical practice, we find ourselves paving the road to hell with our good intentions.\r\n\r\nMost of us aren't trained in ethics, policy or politics - so how do we manage the weighty burden of being responsible for people’s safety? What can we do – both as individuals and as a society as a whole – to try and stop algorithmic harms? And, how do we stop our robots from killing us?",
                "names": "Curtis Parfitt-Ford",
                "pronouns": "they/he",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 13:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Let's Party Like It's 1994 - Re-Imagining How to Find Stuff Online",
                "published_description": "Internet search results were a toxic hellstew of ads, SEO spam, content farms and misinformation/disinformation even before the arrival of Large Language Models like ChatGPT in 2023. In 2024 nearly half the world’s population votes in elections that will have consequential impacts for key issues like climate change and civil rights, and it’s more important than ever before that search results can be relied upon.\r\n\r\nThis talk will highlight a few ways to put search back in the service of the searcher rather than a handful of global megacorps. We’ll time-travel 30 years to the Internet’s Cambrian Explosion period, before Lycos, AltaVista and BackRub/PageRank, and look how technologies like Really Simple Syndication (RSS) and open source self-hosted meta-search engines like SearXNG can help. And then, demo gods permitting, I’ll show you how this can all come together to put a search engine in every pocket.",
                "names": "Martin Hamilton",
                "pronouns": "He/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 13:40:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Lessons learned Open Sourcing the UK's Covid Tracing App",
                "published_description": "On the 7th of May 2020, six-weeks after lockdown was announced, the source code for the UK's COVID-19 contact tracing app was published on GitHub.\r\n\r\nThis is the story of how Open Source helped save lives.\r\n\r\nCome and learn about how we convinced the NHS to open source the app. What pitfalls there were. How we allayed security concerns. What went wrong. How we dealt with trolls. And why it was so important to be as transparent as possible.\r\n\r\nThis talk asks if we did the right thing? Should have done something differently? Could we have been more open? Were the risks justified? Was being Open Source a help or hindrance?\r\n\r\nThis is a personal recollection of a very strange period in health-tech history.",
                "names": "Terence Eden",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Driving fancy LED panels with commodity hardware",
                "published_description": "Ever wondered about what's behind large advertising billboards? Interested in pretty blinking lights? Curious about electronics and circuit board design? This talk might be for you!\r\n\r\nOur hackspace recently got a donation of ~800 LED matrix panels (squares with lots of tiny LEDs on them), with little in the way of documentation. I'll explain how they work, how we got them to light up and display things, and how to make it fast enough to display 30fps video -- all with commodity parts that cost less than 20 pounds.\r\n\r\nWe'll explore the weird and wonderful world of poorly translated datasheets and control software, marvel at the library of weird glitched-out images I ended up with on the road to success, and dive into the strange but extremely useful Programmable I/O block of the RP2040 microcontroller. If the stars align, you'll be able to see everything working on a real demonstration panel, too!\r\n\r\nAlthough we'll be going into detail on some bits, this talk should be accessible to most audiences. ",
                "names": "eta",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 17:10:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The XZ backdoor - what, why, and how?",
                "published_description": "Earlier this year, a developer was trying to benchmark a database. But something was wrong - SSH was taking up too much CPU time in the background. This accidental observation led to the discovery of an audacious attempt to introduce a backdoor that would allow an attacker access to almost any system in the world running SSH, an attack made up of both technical and social components.\r\n\r\nThis talk will describe the backdoor itself, the process that went into it being possible to inject in the first place, and how this was exacerbated by a series of entirely reasonable decisions on the part of Linux distributions. It's a story of social engineering, novel obfuscation mechanisms, and a long con over several years. We'll delve into why distributions patch upstream code, why dependency chains are complicated, and how it's even possible for a compression library to break all the SSH security mechanisms that are intended to prevent this sort of thing from happening in the first place.",
                "names": "Matthew Garrett",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 16:40:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Lightning talks (Friday)",
                "published_description": "Short 10 minute talks on any topic",
                "names": "Thor",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 16:10:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Hack the Printer! Hack the Printer!",
                "published_description": "We all struggle with getting a printer to actually print something, but the more important issue is how can you play the 1995 classic Hackers on their tiny screen?\r\nWe found a vulnerability on a common office printer that allowed us to run our own code on the device. I'll talk about the whole hacking process, from getting access to the printer software, finding and exploiting a vulnerability, and then how we took that to its logical rollerskating 90s conclusion.\r\nI'll include some juicy technical bits of course but hope to make this talk accessible and interesting for everyone.",
                "names": "Toby",
                "pronouns": "he/him",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-06-01 14:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Engineering lessons from a 300 year-old poem  ",
                "published_description": "There are three things about this poem that will surprise you. First: though written 300 years ago, it contains superb guidance on being an engineer or maker of any kind. Second: you’ll immediately recognise some of its best lines. Third: its author was an indomitable twenty-three year old hunchbacked dwarf, who had educated himself due to religious persecution.\r\n\r\nI hope you’ll take away some maxims that’ll stick with you and inform your work.  And if you’re someone who’s never ‘got’ poetry, this may be the poem that unlocks it for you.",
                "names": "Tim Ruffles",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 16:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "High voltage from plastic- Building a Wimshurst machine",
                "published_description": "Derek explains and demonstrates his giant Wimshurst static electricity machine",
                "names": "Derek Woodroffe",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 19:00:00",
                "scheduled_duration": 45,
                "venue": "Odin's Tesla Fest",
                "venue_village_id": 73
            },
            {
                "published_title": "Adventures with Iridium ",
                "published_description": "How do you transmit data when there’s 205,000 people trying to access the same mobile network in a field? Satellites, of course! After facing dilemmas of tracking the staff shuttles at a major UK festival, we decided to look at other options and discovered some cheap Iridium satellite constellation hardware on eBay. When they arrived, we surveyed what we had purchased, discovered it was ex-Ministry of Defense hardware, and hasn’t been scrubbed properly. After getting a new pair of trousers and making the relevant disclosures, we worked to reverse engineer the hardware and get some usable data transmitting into space (and back down).\r\n\r\nThis involved dumping the firmware of the chip, and stepping bit-by-bit through the memory to understand what was happening, as well as a few casual emails to defence contractors. Getting airtime for satellite hardware was also a challenge, and working around the intricacies of Iridium Short Burst Data. Furthermore, we’ve developed the concept into an interactive map that overlays the realtime position of the tracker, and gives speed and heading data.",
                "names": "Blue and Q",
                "pronouns": "she/her",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-06-01 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Amateur Satellite. Development and Operation.",
                "published_description": "An overview of Amateur satellite designs and how to use them.\r\nExtended Q&A session afterwards.",
                "names": "Dave Johnson G4DPZ",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 14:00:00",
                "scheduled_duration": 30,
                "venue": "AMSAT-UK / BATC / UKuG",
                "venue_village_id": 17
            },
            {
                "published_title": "The problem with medical influencers",
                "published_description": "High carb? High fat? Which fat?\r\nWeights, are you crazy? It's all about cardio!\r\nCardio, are you mad? Weights!\r\nIs Diet Coke giving you cancer? Did seed oils cause your gammy knee? Fruits are bad now? Ground yourself, but air your perineum. Suncream is a conspiracy and your brain is infected with mould. Listen to your bowels, the microbiome is in control. Meditate, but don't enjoy it. Stare directly into the sun. Ice baths! Saunas! Ice baths in saunas! (admittedly quite brief)\r\n\r\nAnd whatever you do, DON'T. EAT. ANYTHING.\r\n\r\nWhy is it so hard to find useful and understandable medical information on the internet? Why are the people who we go to so bad at doing it? Why has wellness become a sickness? NHS consultant cardiologist Dr Rohin Francis dives into the wild world of medical influencers to find out why too much information can be bad for your health.",
                "names": "Rohin Francis",
                "pronouns": "He/him",
                "may_record": true,
                "video_privacy": "none",
                "scheduled_time": "2024-06-01 12:50:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Lightning talks  (Sunday)",
                "published_description": "Short 10 minute talks on any topic",
                "names": "Thor",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 11:40:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Weasel Words - meet the developer",
                "published_description": "Met the developer of Weasel Words, Lloyd Henning, in this Q&A/demo!",
                "names": "Lloyd Henning",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 15:30:00",
                "scheduled_duration": 30,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Appybird: Meet the maker - drop in session",
                "published_description": "Meet the maker of Appybird, Iain Sharp, in this drop in session. ",
                "names": "Iain Sharp",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 16:30:00",
                "scheduled_duration": 60,
                "venue": "Main Bar",
                "venue_village_id": null
            },
            {
                "published_title": "Getting Started in Laser Cutting",
                "published_description": "A presentational workshop with Q&A on getting started in Laser Cutting, diodes vs CO2, water cooling vs RF lasers. What is a Galvo Laser? Where to buy and what to expect? What different controllers are there? Which software exists and which to use for what? \r\n\r\nIncluding advice on taking your project from idea to finished item. \r\nCombining laser cutting and 3D printing. \r\nMaterials types and finishing techniques. \r\nLaser cutter maintenance and good practice. \r\nLaser cutting in a shared workshop with multiple users and access control/issues/good practice\r\nWhat is the difference between an expensive laser cutter (£12k) vs cheaper (£3k).\r\nLaser cutting for profit/work.\r\n\r\n* Interests Disclosure - I service and repair laser cutters for a living and have been a contractor to a related software provider for 4 years. \r\n",
                "names": "Dominic Morrow",
                "pronouns": "He, Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 12:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "How to go solar off grid in the UK. ",
                "published_description": "How to specify and deploy an off-grid system in the UK.  \r\n\r\nCovers power requirement calculations and performance tradeoffs in the real world. How to handle low production near winter solstice. Touches on battery selection, care and feeding and dimensioning for a given power demand.  How Inverters were selected. Reliability issues. Aimed at people wanting to deploy their own systems.\r\n\r\nI've been running off grid for the last 5 years in the West Midlands, and will share the what I have learnt during that time.\r\n\r\n",
                "names": "andy fletcher",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:00:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "The Book Ritual",
                "published_description": "The Book Ritual is an interactive art-piece played using a real-world book of your choice.\r\n\r\nWrite in your book to tell it about yourself. Deface its pages in creativity exercises, so that your book can understand you. Tear out pages to keep the conversation going, as it reveals to you how it came to be and why it wants to know you.\r\n\r\nThe Book Ritual is about dealing with loss and accepting grief. The process of tearing up a book allows players to live out the experience of loss and examine the emotions that arise.\r\n\r\nAlistair Aitcheson will give a short talk and demonstration, and be available for Q&A. ",
                "names": "Alistair Aitcheson",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 14:30:00",
                "scheduled_duration": 60,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Security Theatre",
                "published_description": "We will take a peek behind the scenes at the technology used in performing arts venues in order to asses the cyber security implications and how we can address them. A modern performing arts space is no longer several independent systems providing show elements such as light and sound, but rather an IP network fabric delivering the desired elements flexibly around the venue and sometimes beyond. As a community we have gathered a good understanding of designing reasonably secure networks and protocols I would like to apply this knowledge to the unique demands of a theatre.\r\n\r\nIf you often find yourself distracted by the coordination of the light fixtures rather than the performance this talk is for you. Or may you just like designing networks and learning about interesting protocols.\r\n\r\nI previously covered Audio over IP in a talk at MCH2022: https://media.ccc.de/v/mch2022-113-audio-networks-and-their-security-implications\r\n\r\nIn the interest of transparency I am partially employed (and was previously fully employed) by Holoplot a professional audio company that principally sells network based loud speakers. I'm also a freelance security consultant. However, I'm doing this talk purely in a personal capacity and all thoughts an opinions expressed are my own not those of any employers, clients, or customers.\r\n",
                "names": "Morgan Hill (pcwizz)",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 16:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "From Haunted Karaoke to the Humour Feature: an Exploration of Auto-Generated Comedy",
                "published_description": "In a world where large language models like GPT and Gemini are becoming more and more ubiquitous, what does this mean for comedy? If computers getting things obviously wrong is a factor in their comedy value, do the improvements in generative AI take us into an uncanny valley where the outputs are realistic enough to no longer be funny? \r\n\r\nJoin our presenters as they each argue the case for one side of the battle between generations from large language models, vs. more naive generation approaches. \r\n\r\nWe’ll explore what makes comedy funny at all, and then drill deeper into why we find content generated by computers so hilarious - often when it’s not trying to be! \r\n\r\nThroughout the talk we’ll give some examples of humorous computer generated content from past projects - intentional or otherwise. Learn why you shouldn’t join us for dinner when the recipes are auto-generated; see how we abuse state-of-the-art AI safety techniques to make LLMs funnier; and join for a group singalong for some live-generated parody karaoke. ",
                "names": "Ben Below and Matthew Wearden ",
                "pronouns": "he/him/they/them, he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 15:20:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Pip Pepper Park Planner - meet the dev",
                "published_description": "Meet the developer of Pip Pepper: Park Planner! ",
                "names": "Anzal Baig",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-06-01 14:45:00",
                "scheduled_duration": 30,
                "venue": "Arcade",
                "venue_village_id": 79
            },
            {
                "published_title": "Seams Like Magic: A primer on sewing basics",
                "published_description": "At EMF 2022 I ran a drop in sewing workshop. Whilst it was popular, one question that I didn't have time to answer properly was the broad: \"I want to make my own clothes: where do I start?\"\r\n\r\nI'd like to answer just that question in this talk. I'll cover things like: tools/equipment you need (and what you don't!), how to read a sewing pattern, key things to remember and suggestions for easy projects to get started with. \r\n\r\nI've previously worked costuming for theatre and designing/making wedding dresses. Whilst my main focus has been on garment sewing, I'm happy to help people with their wild projects: how to make your projects waterproof, how to make wacky shapes and how to work with weird fabrics are all things I can help with. ",
                "names": "Claire Phillips",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:40:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Myth of Normality",
                "published_description": "I would like this talk to explore the evolutions of human consciousness and the origins of the neurodiversity paradigm which worked both to help us in our early communities and existence both nomadically and early farming and how that has changed throughout the centuries into the modern day. Looking at both the achievements and the struggles over our existence, I'd like to explore what it means to be ND and human.",
                "names": "Simon Hawthorn",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 13:00:00",
                "scheduled_duration": 60,
                "venue": "Workshop 3 (Furry High Commission)",
                "venue_village_id": 39
            },
            {
                "published_title": "How Roadies became Network Engineers ",
                "published_description": "Over the past five decades, the concert & live event industry has undergone a dramatic transformation into a major sector of the economy, with the production playing a pivotal role. Artists and their shows constantly seek the latest lighting & video technology, intricate stage setups, and top-notch audio quality to dazzle fans. Ticket sales are a major revenue stream for Artists, and a high-quality production show, sells tickets.\r\n\r\nThis high level of production is only possible because of an industry full of talented roadies. Behind every arena or stadium show lies a hundreads of engineers tirelessly setting up, operating, and dismantling these elaborate stage setups, often in a new venue, on a daily basis. Long gone are the days of makeshift equipment cobbled together, roadies now navigate highly sophisticated AV control systems supported by intricate network infrastructures.\r\n\r\nA vast array of specialised hardware caters specifically to live events, engineered to be both flexible for on-the-fly adjustments and durable for daily setup and teardown. Reliability is paramount, with equipment expected to perform flawlessly show after show, never missing a beat. \r\n\r\nIn this talk we are going to take an overview into the world of live event production, shedding light on how roadies consistently deliver stellar performances day in and day out. We'll explore the intricacies of AV networks, offering an insightful overview of the behind-the-scenes magic that brings unforgettable concerts to life.\r\n",
                "names": "Nicholas Whitehead",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 14:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "The Edible Native Plant Project, or the Fine Line Between Food and Poison",
                "published_description": "A research project that started with the question, 'what was the average person in Britain eating 500 years ago?', and resulted in a rich knowledge base of over 1200 native and naturalised plants with food uses. The vast majority of our modern foods originate overseas, introduced to Britain by colonialism and Victorian exploration, and the global human diet now contains less than 100 plants, with limited biodiversity.\r\n\r\nStarting from the BSBI's database of native and naturalised plants, over the course of 3+ years I painstakingly reseached each entry for historic, archaeological, or ethnographically documented food uses. This body of ancestral knowledge could help provide local food resilience, reduce the impact of the plants we eat, and better protect food supplies from climate change, pollinator loss and disease. \r\n\r\nThe research is still in its raw form as a giant spreadsheet, so the first part of the talk will focus on the process of research and identification, and some of the trickier questions such as the difference between a food and a medicine, what level of toxicity is tolerable, and how to really define a native plant. The second part will focus on some highlights of the results, including obscure disused vegetables, native things you can still forage, lost recipes for brewed alcohols and psychoactives, vegetables we've bioengineered for edibility, some exciting natural poisions, and addressing whether or not lettuce really exists.",
                "names": "Katherine McLean Forster",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 17:10:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Foxdog Studios: Robo Bingo",
                "published_description": "Bingo meets tech in an interactive, smartphone powered comedy act like no other.  Experience a whole new side of bingo created by Foxdog Studios (Lloyd & Pete) and their robotic bingo mascot, Mr Bing. Expect chaos, games and laughs. Join the fun without leaving your seat as bingo cards are beamed to your phone using their own locally hosted web-based software. Claim your prize by tapping the button and blast “Bingo!” out the main speakers (but be ready to go to bingo jail if you cry wolf). Full of lo-fi robotics and novelty instruments, this hit show is coming from the Edinburgh fringe to Electromagnetic Field.\r\n\r\n“The lo-fi tech wizardry is ingenious, and it’s irresistible fun to play along” Guardian\r\n\r\nAs seen on CLICK BBC and THE PADDOCK Channel 4 ",
                "names": "FoxDog Studios",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 19:30:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Digital Skeleton Keys - We’ve got a bone to pick with offline Access Control Systems",
                "published_description": "Offline RFID systems rely on data stored within the key to control access and configuration. But what if a key lies? What if we can make the system trust those lies? Well then we can do some real spooky things…\r\n\r\nThis is the story of how a strange repeating data pattern turned into a skeleton key that can open an entire range of RFID access control products in seconds.\r\n\r\nIt’s a scrappy but scary hack that spawned from something we noticed whilst trying to duplicate an access card onto a subdermal RFID implant. This covers the discovery of the flaw, how we investigated it, and how significant the flaws ended up being.\r\n",
                "names": "Miana",
                "pronouns": "She/Her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 12:00:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Hackers, Superheroes, and Super Massive Black Holes: Adventures in Hollywood Visual Effects",
                "published_description": "Double Oscar winner Paul Franklin talks about his 30 year career in the movies and how he has brought some of modern cinema’s most iconic imagery to the screen.",
                "names": "Paul Franklin",
                "pronouns": "",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-06-01 13:30:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Thomas the Privatised Tank Engine 30 years on",
                "published_description": "It has been 30 years since Private Eye released this biting satire of the privatisation of British Rail.\r\n\r\nToday, the railway system is now part public part private, leaving plenty of confusion for passengers.\r\n\r\nWho runs your local station? Who sets the rail fares, and who covers your refund? And where the hell does HS1 and HS2 fit into all this? I will take you through how the UK rail organisations are structured, who does and owns what, and how does this affect passengers?\r\n\r\n- What's the difference between Network Rail and National Rail? \r\n- How does split ticketing work? \r\n- What did Labour announce in April?\r\n\r\nAnd most importantly: \r\nWho should I be angry at when I'm crammed in sideways on a delayed Sunday afternoon train to Leeds?\r\n\r\nNo knowledge of the rail industry is required to enjoy this talk, but experts will find it depressing. \r\n\r\nI may swear, mostly about MPs.",
                "names": "Ashley Rolfmore",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 16:30:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Remote controlled Chaos Cart - How to motorise trash.",
                "published_description": "Using a fad of the 2010s and the UK's most popular river dweller the Leeds hackspace has combined 2 hoverboard wheels with a shopping trolley to create a monstrosity. Armed with a PA system, rally lights, under glow and 2 car horns it’s the perfect centre of chaos for protests or your ALDI shop.\r\nDuring our presentation, we invite the audience to delve into the fascinating world of motorising random objects and the art of upcycling, along with the myriad challenges we encountered along the way. From designing our own lithium-polymer batteries to countless iterations and rigorous testing, we'll discuss the intricacies of dealing with electromagnetic interference, experimenting with various motor controllers, and even designing our own from scratch. We want people to experience the shenanigans we went through and the fun we had along the way to hopefully get more people into whacky-wheeled…..wehicles.\r\nBut it's not all talk! We're excited to demonstrate the trolley live, allowing you to experience first-hand the joy and sheer mayhem it brings. Our goal is to inspire you to embark on your own wacky-wheeled adventures, learning from our missteps and benefiting from our advice and tips.\r\nNo Project is ever truly done lastly we want to look into the future: The intended use cases and how we aim to share our knowledge and plans with the wider community. Our commitment to openness and collaboration means that anyone bold enough to motorise anything around them can benefit from our experiences and insights.",
                "names": "Hendrik, Gwen and Callum",
                "pronouns": "Hendrik (any), Gwen (She/Her), Callum (He/Him)",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 14:40:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Working Amateur Satellites on a Budget",
                "published_description": "Always thought it was expensive to receive signals from Space? In this talk I will go through the simple homebrew antennas and cheap (around £10) receivers that you can use to get such diverse things as weather satellite images, pictures from the ISS, receive telemetry from the orbiting CubeSats, and even begin communicating with the first Amateur Geosynchronous Satellite, QO-100 where you can receive TV pictures from amateurs across the world with a rust old satellite dish and a cheap LNB. It is amazing what you can do with a piece of bent water pipe or a coat hanger!",
                "names": "Heather Nickalls",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 13:50:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The Last Miles of The Internet",
                "published_description": "How does your home router get to the \"internet\" in the UK? With the rise of alternative fibre networks, and major operators finally deploying fibre to the home, the copper cables that have connected us since the 1900s are being rapidly replaced with fibre networks.\r\n\r\nThis talk will dive into the detail of how these new optical fibre access networks being deployed today actually work, and how cat videos get from the internet to your home.",
                "names": "James Harrison",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 12:20:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Infrastructure Review",
                "published_description": "Members of the EMF infrastructure teams (network, power, lighting, video, telephony) will talk about how we made the event happen this year. There will be graphs.",
                "names": "EMF Team",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 18:00:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Hackers Q&A",
                "published_description": "Following the screening of Hackers, directory Iain Softley and vfx artist Paul Franklin (creator of Hacker's 'city of text') will be joined on stage by author and Empire Magazine editor-at-large Helen O'Hara. Find out about how the film was made and it's pivotal role in the transition for motion-capture effects to the new dawn of CGI, as well as it's place in hacker culture today. You'll have a chance to submit your questions before the showing.\r\n\r\nIf you fancy breaking out the red eyeliner, come in Hackers cosplay for a chance to win a prize.",
                "names": "Iain Softley & Paul Franklin",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 22:35:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "I Hacked Into My Own Car and other stories",
                "published_description": "I'm not a hacker. But I did manage to unlock my car with a laptop, and I'll show you how to do it. Please don't steal my car afterwards. And I'll show you how I reverse engineered a talking robot toy from the 80s to make it say scary things. And how I predicted the exact time of my child's birth with excel. During the labour.",
                "names": "Steve Mould",
                "pronouns": "He/him",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-06-01 17:50:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "How to escape from a WW2 POW Camp",
                "published_description": "During WW2, British plane crews sometimes found themselves imprisoned behind enemy lines. With only light punishments for escape attempts, some of these prisoners worked on incredible schemes to get back home. This illustrated talk will talk about these escapes, from famous ones to those that are undeservedly forgotten. It's a story of impressive creativity, of people trying to hack their way to freedom, including tunnels, dummies and an attempt to build a plane. ",
                "names": "James Burt",
                "pronouns": "He/They",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Science Magic...Magic Science",
                "published_description": "To spell bind the audience, gasp, wonder and laugh. \r\n\r\nDemonstrations, the eerie strange sound of the theremin and it's analogue, the musical saw. Resonance, levitating objects,  and the occasional funny smell, now accompanied by Robots, Hugi, Tibbles and Ani. Arduino controlled automata, a cat, a bird and a skull. Even some “Real” Magic Tricks.\r\n\r\nPresented by an experienced science show presenter.\r\n \r\nThe show of Science Magic, mystery, suspense and laughs.  Suitable for all ages.\r\n",
                "names": "Ian B Dunne",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "A Short History of Electric Shocks",
                "published_description": "This talk is about our delight, awe and fear of electricity and its effects on the human body. It charts our changing relationship with it from the 18th century to today. I particularly love the 18th century gentlemen scientists with their electrical entertainments - particularly because they appreciated the magic of electriocity and were so excited by it. Its sad that people today just take electricity for granted. Over the years I've accumulated a collection of contemporary images which I'll use to illustrate the talk. It may include a few demonstations as well. ",
                "names": "Tim Hunkin",
                "pronouns": "He/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 15:50:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Forgotten graphics technology: the wild workings of the direct-view storage tube CRT",
                "published_description": "It's 1975! You need a high-resolution computer display for fine drawings (e.g. CAD diagrams). Memory's EXPENSIVE, processors are slow: what to do? Here's an analog solution to a digital problem: an unusual cathode-ray tube that preserves whatever it draws with no flickering, fading, or any kind of refresh. A brilliant dot sears emerald trails into the screen, rendering intricate line-art without pixels. No need for video memory when the screen itself remembers!\r\n\r\nIt's mesmerising to see this special tube in action; more satisfying still to know how it works. Discover a mechanism Tektronix refined over three decades, growing from palm-sized oscilloscope readouts to 25\" computer-lab behemoths. A wreath of electron guns, kilovolt potentials, microscopic cobalt cones, and transparent anodes set the stage for a nonlinear dance of charges that yields visualisations with style --- and we'll unravel its mysteries with animated diagrams. En route we'll visit notable storage tube applications, from early computer memories to 1978's _Battlestar Galactica_. Of course we'll see a real Tektronix terminal at work, too!\r\n\r\nComputer memory is cheap now: by the mid 1980s, modern displays had advantages storage-tube systems couldn't overcome. Nobody's making them anymore, so check out this talk while old stock still works!",
                "names": "Tom Stepleton",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 15:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "How to map caves",
                "published_description": "Caves present a challenging environment to survey and map. Conditions are often wet, muddy and involve confined spaces. This talk will look at how the technology we have developed has changed how we measure and create maps of cave systems. From traditional sighting compasses, tape measures and paper and pencil, to laser measures, bluetooth data transfer and PDAs or mobile phones as recording and drawing devices. Then once the data is collected underground, how open source software has been developed by cavers to process the data and draw maps which adjust to later changes in positions of parts of the cave when more data is collected or corrected. We'll look at loop closures, explorations of places no person has gone before, and different ways to present a 3 dimensional map of a 70km cave system. There will be plenty of photographs and video clips of cave exploration, along with live software demos and viewing of digital maps.",
                "names": "Footleg",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 12:20:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "The story of Älgen guitar: how to mix traditional hand-craft woodwork with cutting-edge digital fabrication",
                "published_description": "This talk will take a look at Älgen, a custom-built guitar that is a fusion of traditional hand-crafted woodwork and advanced 3D-printing and generative-design techniques. The guitar is built using no less than 4 different types of 3D-printing, including 3D-printed aluminium. At the same time it sticks with traditional hand built woodwork for the playing surface, matching material with function.\r\n\r\nThis talk will focus on the design behind the guitar, looking at what you can do with generative design and 3D-printing, how to interface the old and new construction techniques (e.g., mating a walnut body with 3D-printed nylon sides), and how to decide what bits to do with which technique. \r\n\r\nI'll also show how I achieved this as an amateur maker: the aim is to show the audience that what seems like far-out construction is actually reachable by us mortals thanks to improvements in tooling and 3D-printing services.",
                "names": "Michael Dales",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 18:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "EverSong - singing voice transfer with Google Magenta’s DDSP + diffusion-based vocoder.",
                "published_description": "Emily Peasgood and Mark Hanslip will present a talk on creating EverSong, followed by an invitation to try their vocal transfer models in real-time. \r\n\r\nEverSong is a sound installation where you can hear the lifespan of a person in a song, from 5-years-old at the start to 95-years-old at the end. It explores the fragility of life, its circularity, invites people to celebrate the moment we are in right now and questions our legacy as humans moving into an increasingly digital age. \r\n\r\nSince January 2024, Peasgood & Hanslip have worked with DDSP-SVC, a newly-developed process which builds on Google Magenta’s DDSP by combining it with a diffusion-based vocoder. They recorded vocal datasets with people aged 5-95 and trained models which can be mapped onto Emily’s voice enabling her to sound younger and older than she is. \r\n\r\nThis technology is starting to be adopted by contemporary pop musicians, high-profile examples being web services such as Grimes’ Elf and Holly Herndon’s Holly+. \r\n\r\nEverSong represents a new application of this technology by making it possible to hear a voice age in real time. It will be experienced in tunnels and pathways, installed sustainably in nature, touring before finding a permanent home in an ancient site.",
                "names": "Emily Peasgood & Mark Hanslip",
                "pronouns": "Emily: she/her. Mark: he/him.",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 13:20:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Downpour & more: how and why to make creative tools",
                "published_description": "I recently released Downpour, an app that anyone can use to make little games on their phone. And before that I made Cheap Bots, Done Quick, a website that anyone could use to make a Twitterbot on their computer. And so unsurprisingly I am a big advocate of making creative tools - I love the feeling of seeing other people make cool stuff, and knowing that I enabled that to happen. In this talk, I'm going to talk about some design principles I've gathered from making these kinds of things, share some stories of people using them in ways I didn't expect, and generally try to persuade you that it's an interesting space that you might want to play in.",
                "names": "v buckenham",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 16:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Closing ceremony",
                "published_description": "The ceremony in which we close the festival. Goodbye!",
                "names": "EMF Team",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 19:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Hackers Introduction with Iain Softley",
                "published_description": "Before our 29th Anniversary screening of the EMFCamp favourite Hackers, director Iain Softley will introduce the film. Bring your best cosplay game and stick around afterwards for a full Q&A.",
                "names": "Iain Softley",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 20:30:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Fighting Allergies with Pollen Forecasting",
                "published_description": "Many people rely on pollen forecasts to know when their allergies are likely to cause trouble. So when the main source of them in Finland scaled back after losing funding, a replacement was needed. Hear about the process of starting at zero knowledge of pollen forecasting, discovering the available models and data, and putting it together to get 3-day forecasts for any location in Europe, as a hobbyist with some help from the Finnish Meteorological Institute. Includes learning about atmospheric science, academic data, coordinate projections, Rust and more.",
                "names": "Scott Street",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 13:30:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Exploring and extending the Elite game engine for the BBC Micro",
                "published_description": "If you are a British nerd of a certain age, you almost certainly played Elite on the BBC Micro. And if you didn't, this talk will explain why you should care about a now 40-year-old game.\r\n\r\nIt was years ahead of its time, with 3D graphics, a procedurally generated open world, and a whole novel's worth of lore - all running on an 8-bit home microcomputer in 1984, when most games were little more advanced than Pac-Man or Space Invaders.\r\n\r\nOver the last few years, I've been picking apart the original Elite game engine to understand how it worked, and also to experiment with extending it.\r\n\r\nIn this talk, I'll examine some of the methods that the game used - how it used the graphics hardware, how the game state is represented in memory, how the ship models were designed, how the AI worked, and how galaxies and planets were generated. I'll also explain some quirks of the game... including the real reason that docking was so hard.\r\n\r\nI'll demonstrate some new tools I've developed, which access the game state in real time, letting you experience the original game in new ways - including an OpenGL frontend with VR support, and an attempt to recreate an arcade-style version of the game, with an old-school vector display.\r\n\r\nFinally, if all goes to plan, I will attempt to demonstrate something that was an impossible dream for 40 years: multiplayer Elite on the original BBC Micro version.",
                "names": "Martin Ling",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 12:40:00",
                "scheduled_duration": 40,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Live tour of the Boulby Underground Laboratory - a special science facility 1.1km underground!",
                "published_description": "A rare live two way link with the Boulby Underground Laboratory, where the Boulby team will give us a tour of the underground facilities that include a Mars Yard, where real (and LEGO) Mars rovers are tested, multiple Dark Matter research experiments, understanding the radioactivity of substances and more!\r\n\r\nHave any questions you want answered? Email them to will.furnell@stfc.ac.uk\r\n\r\nBoulby is one of just a select few facilities in the world suitable for hosting ultra-low background and deep underground science projects. It is a special place for science, 'a quiet place in the Universe', where studies can be carried out almost entirely free of interference from natural background radiation. It also provides access & support for studies of the geologically interesting deep underground environment.\r\n\r\nWe are employees of the Science and Technology Facilities Council, the UKRI research council that runs the facility.",
                "names": "Jonny Gutteridge, Will Furnell, Boulby Team",
                "pronouns": "he/him, they/them",
                "may_record": true,
                "video_privacy": "review",
                "scheduled_time": "2024-05-31 14:30:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "How to get anything from anywhere to anywhere",
                "published_description": "You have an object / art installation/auction purchase and want it somewhere else? What are the options of getting it there without breaking yourself?\r\n\r\nThis will be a short, hopefully entertaining, overview of transport options, their financial and environmental impact and the time they take. This talk is based on examples of personal experience sending hacky art installations around Europe and the globe.\r\n\r\nBy doing this many questions had to be answered for example:\r\n- how big are doors?\r\n- why acessability regulayions are great or not?\r\n- what fits in an elevator?\r\n- how much fits in a van?\r\n- what fit’s in a cargo aeroplane?\r\n\r\nThere will be dragons! Along the way we’ll encounter customs officers, new excitement around rules for international road haulage, air freight and how astronomically long container shipping takes. \r\n",
                "names": "Robert Nixdorf",
                "pronouns": "He him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 16:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "HEU1993 to WHY2025: Dutch hacker camps from the past and the future",
                "published_description": "The Dutch hacker camps take place between editions of EMF. They have a long history and a bright future! In this talk the Dutch camps from the past will be visited and the state of the next camp, WHY2025, will be presented. ",
                "names": "Boekenwuurm",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 18:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "How to make a puzzlehunt",
                "published_description": "What do semaphore, octopuses, Scrabble, rotary telephones and Microsoft Paint have in common? If you've been to previous EMFs, you might recognise these as some of the themes for our puzzles!\r\n\r\nWe are Dreamcat and we are a group of friends who made our first puzzlehunt for EMF 2018 and haven't stopped since. We love the combination of escape room, treasure hunt, video game, and just a dash of immersive theatre. We want to share that enthusiasm with you, talk about our top mistakes from the last 6 years and what we learned, and hopefully inspire you to go make your own puzzlehunts.\r\n\r\nCome along to learn:\r\n- How to co-opt serious IoT tools for frivolous escape room purposes \r\n- Why Portal is still the best video game ever made\r\n- How hard, actually, is “too hard”\r\n- Exactly how many paperclips were harmed in the making of this year's experience \r\n\r\nNo spoilers for this year's puzzlehunt. Unless you come talk to us at the bar after.",
                "names": "Sarah Binney",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 18:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "London to Brighton, by train and on foot",
                "published_description": "During the pandemic, trains got weird for a while. We weren’t quite sure whether it was safe to travel collectively, and the impacts of that difficult time continue to shape our railway network to this day. \r\n\r\nMeanwhile, many of us were exploring our own, hyperlocal neighbourhoods on foot with obsessive levels of depth that we never otherwise would have got around to. (Was I the only one who highlighted every street I walked in a London A-Z to see if I could get complete coverage?!)\r\n\r\nIn 2021, I did a design-based MA all about railways, railway infrastructure, and what it means to travel and live communally. To do this, I walked all the way from London to Brighton (in sections), following the railway line as closely as possible. This is a talk about what I saw and what I thought about, and will hopefully be enjoyed by fans of trains, hiking, community and travel. (And anyone else who fancies a sit down, I’ll try and make it interesting, I promise)",
                "names": "Emma Charleston",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 12:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Spotting Seals with Sonar (and A.I.)",
                "published_description": "Tidal energy is one potential source of green energy but the impact of placing large turbines on the seabed is not fully understood. In particular, how are sea mammals coping with such changes in their environment? Do we need to put automatic mitigations in place – is it even possible? For over a year, we have been annotating more than 60 terabytes of data, finding these rare events of interest. We’ve looked at whether Artificial Intelligence, combined with sonar, can automatically spot and classify interesting underwater objects. We’ve tried several approaches, some more successful than others, but there are promising results with movement detection and segmentation. \r\n\r\nThis talk covers our initial findings - where we went wrong and one promising approach that we are still actively researching. I'll be talking about U-Nets, convolutional neural networks, sonars and the unknown entities that may lurk in the depths!",
                "names": "Benjamin Blundell",
                "pronouns": "He",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-05-31 18:10:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "How to 3D Print A Rocket Engine",
                "published_description": "A talk about the state of the art with metal 3D printing, and how it can let you make rocket engines much more cheaply and quickly than ever before. \r\n\r\nI will briefly describe the anatomy of a rocket engine and why the extreme conditions it must endure make designing one hard, and then introduce powder metal 3D printing and how you print an engine. I work for a company in this field, and I will show various images and videos of our engines being fired, as well as the engines themselves so that people can have a look, and some samples with internal cutaways to show the internal structures that 3D printing technology now makes relatively easy. \r\n\r\nI will also discuss drawbacks and common failure-modes of 3D printing for rocket engines, and talk about where new advances in the field might take us, such as multi-metal prints, hybrid machining, and other exciting technologies.",
                "names": "Ed Moore",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 16:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "How to give your electronic projects a professional looking finish",
                "published_description": "This talk is a ‘how-to’ or recipe to make your electronic projects look professionally finished. It will cover simple graphic design and small-scale metalwork with hand tools. The emphasis is on the techniques useful for personal making and hobby use. \r\n\r\nAs an example we'll look at how to make a professional-looking bench power supply for general test and experimental use.",
                "names": "Peter Miller",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "review",
                "scheduled_time": "2024-06-01 19:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Whispered Secrets: Building An Open-Source Tool To Live Transcribe & Summarize Conversations",
                "published_description": "Are you secretly a spy and/or passionate about open-source? Maybe you don't trust a cloud-hosted service with your highly classified information, or perhaps you like to build things for yourself. In this light-hearted talk, you will learn how to make a real-time on-device GenAI-powered application that can live transcribe and summarize conversations without internet access, using open-source components.\r\n\r\nOur journey begins with an introduction to open-source LLMs and the latest trends in running GenAI tools on your own hardware. We will build up our application step-by-step, first creating a live streaming voice-to-text transcription pipeline, then an LLM-based conversation summarization layer, presented within a Streamlit frontend, with conversation summaries sent to a lightweight Django API backend for storage.\r\n\r\nHere's why this matters:\r\n1️⃣ Cloud-hosted SaaS tools cannot store highly sensitive information.\r\n2️⃣ Good open-source alternatives exist for most GenAI tasks; the more people who use them, the more they will thrive.\r\n3️⃣ Commercial tools will solve for common use cases, but developers can build personalised tools that are highly specialised for their own bespoke needs.\r\n\r\nThis talk is tailored for Python enthusiasts and requires no ML expertise. By seeing a practical demo come together piece by piece, attendees will gain a deeper understanding of how to build their own complex Generative AI applications and be pushed to imagine what they could make for themselves using on-device computation in real-world scenarios. Expect plenty of Python code and some fun live demos, with GitHub code provided for attendees to try it at home.",
                "names": "John Sandall",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 12:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Living on the canals of the UK - Lessons from the water",
                "published_description": "The canals of the UK have undergone transformation from industry to decay to leisure and in recent years to housing. \r\n\r\nIn this talk, we'll go through some of the history of this modern day shanty town along with lessons for any budding boaters considering life on the cut. We'll cover the fundamentals of boat life including legality, work from home challenges, common pitfalls new boaters can face along with everything you need to know if boat life could work for you!",
                "names": "mark s brown",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 15:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The Tech behind the Tennis - A peek under the hood of a Grand Slam Tennis Tournament",
                "published_description": "For two weeks every summer, half a million people attend the oldest and most prestigious Tennis Tournament, with another billion people following from afar. Underneath the pristine courts of Wimbledon, a massive technology operation underpins almost every aspect of the event, from the grass growing, to the scores appearing on screens around the world.\r\n\r\nThis talk will cover the many interesting ways that technology supports this huge live event as well as a behind the scenes peek of the IBM operation in the broadcast centre.\r\n\r\nIBM has been the Official Information Technology Partner with Wimbledon since 1990. Presenter works for IBM as part of the Wimbledon team",
                "names": "James Sutton ",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 11:50:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Contrary to popular belief, tech needs unions",
                "published_description": "It's no secret that the tech sector is notoriously lacking in unionisation compared to more traditional industries; We'd like to talk about why this might be, why it's a bad thing for everyone, and how we might go about fixing it.",
                "names": "United Tech & Allied Workers",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 13:40:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The Tiny Tool Kit Manifesto",
                "published_description": "What is the best tiny toolkit for hacking in a field, fixing robots in the wild and repairing products for friends?\r\nWe've spent years creating our own bespoke tiny toolkits, with tiny tools, that work for our own specific needs as makers and hackers.\r\nIn this talk, we will share the knowledge we’ve gained along the way, a philosophy of tools and tiny toolkits, the best of the tool kits we’ve assembled, and the most trusted tools we've collected, made and modified. \r\nWe hope that you too, will be inspired to make your own tiny tool kit.\r\nSmall is Beautiful.",
                "names": "Drew  Batchelor",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:40:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Mothers' G(q)uilt: An exploration of mothers' experiences through an interactive quilt",
                "published_description": "This is a talk about how we combined textiles, electronics and storytelling to provide a platform for people to share experiences. \r\nFor this project, we wanted to explore more the findings of previous research around the guilt mothers feel when feeding their babies, but in a more creative way. Coming at the project from 3 very different points of expertise, we worked with mums to design and make a touch interactive quilt.\r\nWe asked mothers of young babies to describe their emotions around feeding, a topic often emotional and controversial, and send a voice clip along with a piece of their baby’s clothing which we stitched together to create a special interactive quilt. The quilt is embedded with electronic touch sensors which activate the clips when the metal buttons of the clothes are touched. By interacting with them you can hear the stories through headphones. All this results in a very intimate and emotional experience that provides a platform for visibility and understanding and we think is a great conversation starter to share stories and create community. \r\nThe talk will include a timeline of how we created a digitally augmented quilt, and a few thoughts if you want to make one too. It will also include some of our own reflections when working on a project that brings up difficult emotions and sensitive topics. ",
                "names": "Sophia Komninou",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 14:20:00",
                "scheduled_duration": 20,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "BIG PIPES! A dive into Scotland's hidden underground hydroelectric infrastructure 🌊",
                "published_description": "A look at the history and construction of Scotland's hidden network of remote dams, tunnels, shafts and underground generating stations. Not many are aware of how extensive, ground-breaking, enduring and socially significant the hydro infrastructure hidden under our Lochs and Glens really is. Come and join me for a healthy dose of BIG PIPES!",
                "names": "Andrew Simpson",
                "pronouns": "He Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 12:20:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Creation of Number",
                "published_description": "An entertaining journey through humanity’s mathematical attempts to wrestle with the deepest questions behind our day-to-day use of numbers, and their consequences.\r\n\r\nWhere do numbers come from?\r\n\r\nExplore the philosophy of maths behind everyday examples and familiar numbers.\r\n\r\nGet a glimpse of what lies beyond your understanding of the real numbers, and how abstract mathematical ideas have changed the world we live in.\r\n\r\nIs maths created by us, or are we discovering eternal truth?\r\n\r\nBen is a mathematician, musician, and public speaker, and often seen on YouTube channels such as Numberphile.",
                "names": "Ben Sparks",
                "pronouns": "",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-06-02 13:10:00",
                "scheduled_duration": 40,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Photobombed by a Robot Arm in space",
                "published_description": "Get ready to take a trip into space.  We'll be travelling 400km up to the International Space Station, to take a look at Earth through the lens of the Astro Pi computers that were sent there in 2020. \r\n\r\nThis talk will focus on what has been learnt from years of giving young people the chance to take photos from the ISS using affordable commercial hardware. There will be plenty of the amazing images that have been captured so far, along with some examples of unexpected interruptions and the challenges when you can’t actually see or touch the equipment yourself. \r\n\r\nThere will also be a chance for the audience to join in with an interactive game based on some of the photos. You'll need an Internet connected device to join in. \r\n\r\nGround replicas of the actual hardware will also be on show and available for inspection. \r\n\r\n",
                "names": "Richard Hayler",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 16:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Creating searchable Post Office Inquiry transcripts",
                "published_description": "The Post Office Horizon IT Inquiry was established in 2020, led by retired high court judge Sir Wyn Williams, to investigate the “failings which occurred with the Horizon IT system at the Post Office leading to the suspension, termination of subpostmasters’ contracts, prosecution and conviction of subpostmasters”.\r\n\r\nTranscripts of the inquiry hearings are put online, but only in PDF and text format. This talk will explain my history of scraping and parsing official information, how I have taken these transcripts and converted them into a linkable, searchable, and readable version, how I automatically keep the site up to date, and why I've done this.",
                "names": "Matthew Somerville",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 15:20:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Are archivists pointless when the cloud can just save everything?",
                "published_description": "I’m an archivist. Every day I deal with the records that people chose to save, or forgot to destroy. Archival material ranges from the sublime (Royal wills, lost love letters, newspapers announcing the Titanic’s demise) to the ridiculous (broken chips of wax from old seals, IOUs from unknown persons, too much human hair).\r\n\r\nA key role of an archivist is to decide what to save and what to destroy. But this is the past. Today most records are no longer on paper but sent in the form of bytes and I’ve started to wonder what the point of my job really is? We have free access to near-unlimited email inboxes, all our photos are backed up to the cloud to access from anywhere, and instant messaging is synced between our devices. Why bother deciding what to keep for posterity? Just save everything, let computers do the hard work, and all will be well. \r\n\r\nThis approach unsettled me so much that I set off to explore what it would really mean if we “saved everything”: how this would affect our world, communities, and ourselves as humans. In this talk, I will share this journey and my thoughts with you, and try to persuade you that my job is not in fact pointless.",
                "names": "Erinna Cave",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 11:20:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Activism in Games, plus a Hopepunk RPG (Role-Playing Game)",
                "published_description": "Resistance, systemic change, and our sustainable future can – and must – be playful! To quote the activism artist group Guerilla Girls: “If you can make someone who disagrees with you laugh, you're in their brain, and you can change minds.”\r\n\r\nThe speaker will begin by sharing her journey in social impact games and its landscape, focusing on activism initiatives in games. She will draw examples primarily from the UN’s Playing for the Planet’s Green Game Jam which includes ustwo games’ Monument Valley 2's The Lost Forest. Surveys from the jam reveal how games can spur positive actions in real life.\r\n\r\nThen we take action -- through play. In this RPG-lite / communal storytelling experience curated by the speaker, a few volunteers will take on special roles to battle a dragon turned to the darkside. We’ll meet in our imaginary tavern and adventure together to save the world!\r\n\r\nLet’s play and change the world together.\r\n",
                "names": "Jennifer Estaris",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 11:20:00",
                "scheduled_duration": 50,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Amateur Satellite/Cubesat. Development and Operation.",
                "published_description": "An overview of Amateur satellite designs and how to use them.\r\nExtended Q&A session afterwards.",
                "names": "Dave Johnson G4DPZ",
                "pronouns": null,
                "may_record": null,
                "video_privacy": null,
                "scheduled_time": "2024-05-31 14:00:00",
                "scheduled_duration": 30,
                "venue": "AMSAT-UK / BATC / UKuG",
                "venue_village_id": 17
            },
            {
                "published_title": "Toys for Elephants",
                "published_description": "About the challenges and delights of designing playful interactive systems with elephants currently living in the UK, featuring elephants with brambles, supersize balls, giant sliders and didgeridoos, being curious, affectionate, playful, apprehensive, bored, wilful, impatient, destructive, muddy, moody and matriarchal.  \r\n\r\nThis is an ongoing project, focusing on offering choice and control in elephants’ environments to investigate preferences around audition and design aesthetics.  Enrichment goals are to provide interesting cognitive and sensory experiences that encourage the expression of natural behaviours.  We’ll consider the why, what and how associated with all of that animal-computer interaction stuff, and invite people to share their thoughts and suggestions - either remotely or subsequently over a cup of tea.  Love and respect to the elephants in your life.\r\n",
                "names": "Fiona French",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 15:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Being Elliot Carver: How to run your own Cable TV station (or network)",
                "published_description": "There's nothing good on TV, and streaming curses you with the Paradox of Choice. So why not be Elliot Carver for a day and run your own Cable, satellite or UHF TV station - or even a whole network?\r\nWith a few low-cost computer boards (Raspberry Pi's work but others are fine too) and video modulators, you can recreate the wonders of 1990s Cable TV in your own home, flat, or living room.\r\nI'll also talk about going further and how I recovered and resurrected a General Instrument ACC-4000 headend controller PC and used it to configure a small fleet of cable boxes.",
                "names": "Phil Pemberton",
                "pronouns": "He/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 17:20:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "An engineer’s guide to parenthood",
                "published_description": "A lot has happened at the other end of life since the last EMF camp; pregnancy, birth and adjusting to life with a tiny human.\r\n\r\nI am an engineer, so when two thin blue lines appeared and I found myself thrown into the chaos of pregnancy and parenthood, I discovered that the best way of dealing with it was to use the engineering approach that was already ingrained in me. “An engineer's guide to parenthood” if you will.\r\n\r\nSome bits worked (some less so!) and that’s what I want to share with you this year, following on from my 2022 talk, \"An engineer's guide to grief\".",
                "names": "Ella Barrington",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 12:20:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Making Music with Hair",
                "published_description": "Combining his deep interest in the biology of hair with generative music systems, Chris will give you a an insight into how he has brought the two fields together. \r\n\r\nAfter a chance introduction to an Austrailian biology student in 2022, Chris and Jay have spent the last few years researching the mechanics of hair growth, the structures of Amino Acids and Keratins and the composition of different parts of human hair. They used this research to develop a suite of software tools that use these bio-mechanics as a structure for creating music.\r\n\r\nChris will cover:\r\n- the biology of hair\r\n- generative music systems\r\n- implementation in Max/MSP and Ableton Live\r\n\r\nThe talk will end with a brand new piece of music created from a single strand of hair. \r\n\r\n",
                "names": "Chris Bartholomew",
                "pronouns": "he/they",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 14:00:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Hebocon 2024",
                "published_description": "Hebocon is Robot Wars for those who are not technically gifted, or who would like to stop being technically gifted for a few hours.\r\nTwirling assemblages of junk face off against hot glue monstrosities, whilst some contenders might fail to move at all.\r\n\r\nThe most successful robots are those which are truly ‘heboi’, meaning technically poor or low in quality. These are bots constructed without the technology or skill that you’d usually expect in a robot fighting tournament.\r\n\r\nWatch 16 robots battle it out and fail joyously!\r\n\r\nGet a ticket for the Hebocon Building Workshop if you want to compete! Kits and building materials are provided there, and the first round of the competition will be happening there.",
                "names": "Jed Preist",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 14:00:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Astrophysics for Supervillains",
                "published_description": "“Could you crash the Moon into the Earth?”\r\n“If the Sun explodes, would we all get vaporized?”\r\n“What’s the weather like on Mercury?”\r\n\r\nDiscover the answers to these questions (and many more!) at \"Astrophysics for Supervillains\"! Facts about space are all well and good but discovering that if you threw someone into a black hole, they would be spaghettified – stretched out long and thin before getting squashed smaller than an atom – is truly, fascinatingly gruesome.\r\n\r\nThis quirky space talk will teach children about the solar system, galaxies, the universe, and, most importantly, the answer to the question “Which planet is entirely populated by robots?”. \r\n",
                "names": "Matthew Bothwell",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 14:40:00",
                "scheduled_duration": 40,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Data is plural",
                "published_description": "I once accidentally got YouGov to poll whether it should be ‘the data is’ or ‘the data are’. \r\n\r\nWhether you favour 'are' or 'is', in many ways, data is plural. When we talk about data, we’re talking about different things, contexts, needs, and perspectives. Thinking of ‘data’ as a singular thing brings risks. We always have to set data in a more plural context and can never think about ‘just’ the data. And data we think of as being about us – singular, as individuals – is often about a plurality of others, and its value – to governments and tech companies – is in plurality or aggregate. All of this means we need to rethink our approach to data and take a relational, collective and democratic - a plural, political and human – approach.",
                "names": "Gavin Freeguard",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 17:00:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Run your own fucking infrastructure - 2024 edition",
                "published_description": "In a 2012 talk about running your own infrastructure I made some predictions on the future and made some claims. A long time has passed and let's see what came true and what was not so correct. \r\n\r\nAfter that talk we also started building our own infrastructure. I will show what we are running, what you can run and share experiences running infrastructure for larger groups of people.\r\n\r\n",
                "names": "Elmar mc.fly Lecher",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 11:40:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Keeping on track - the running behaviour of railway vehicles and their safety",
                "published_description": "How trains behave dynamically as they run along the track - their running behaviour – is a fundamental to railway safety.\r\n\r\nI am mechanical engineer with 35+ years’ rail industry experience, working in the fields of vehicle design, analysis, and railway safety – both in the UK and overseas.\r\n\r\nI will endeavour to explain the principles of the individual mechanisms involved, how they work together, and what makes some of them quite unique. I will take time to look at some of the design solutions and approaches used to control dynamic behaviour and some of the risks that are associated.  There may also be an opportunity to look at some of the basics behind the maths along the way. \r\n",
                "names": "Nigel Shaw",
                "pronouns": "He/him",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-06-01 14:10:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The Journey is the Reward: Discovering the Fun in small Production Runs",
                "published_description": "bleeptrack is an award winning creative technologist from Germany, working in the fields of generative art and digital fabrication. Twice a year, she sends out unique generative art pieces to her patreons and supporters. These pieces vary drastically in their appearance: from classical paper art works to PCBs, stamps or shirts, bleeptrack is not shy in experimenting with all sorts of materials and fabrication techniques. But most importantly: each piece is unique and created from code.\r\n\r\nIn her talk, bleeptrack will guide you through multiple production processes with it's challenges and explains why it's a lot of fun for her to set up little production pipelines over and over again.",
                "names": "bleeptrack",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 19:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Badge Talk",
                "published_description": "In which the badge team have a natter about the tildagon badge, the hexpansion format, the development process, pitfalls and panics along the way.",
                "names": "The Badge Team",
                "pronouns": "they/them",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 14:20:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "A Brief History of Calendar Systems and Movable Feasts",
                "published_description": "Join us for a calendrical safari of the weird and wonderful history of Calendar Systems and Movable Feasts. Marvel, as we compute the date of Pancake Day. Gasp, as we gaze on the metric madness of the French Republican calendar. Find out why on earth, the UK tax year starts on April 6th?! ",
                "names": "John Dalziel",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 16:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "The Role of Media in Impact Campaigns",
                "published_description": "Special event - Talk followed by secret film screening\r\n\r\nWhat do impact campaigns accomplish in the creative landscape, and what is the role and responsibility of the media in driving that social impact? Inspired by the film \"Don't Look Up\", where Benn produced the impact campaign, we will explore this dynamic together. When the ethics are no longer focused on being accurate, but rather being first,and being attention grabbing, it becomes difficult for people to discern what is and is not an important story. So we wonder how some of the most important stories either fall through the ether entirely, or are seen and dismissed by the apparatus of the 24 hour news cycle and 3 second refresh feeds. That's what films like Don't Look Up tackle so well.\r\n\r\nBenn is a SXSW Grand Jury Prize & UNICEF Prize winning, Oscar Shortlisted, Webby nominated producer. He has been a social impact advisor and producer working across film, games and events, with a mission to bridge gaps between story and policy, and ultimately champion vast perspectives to aid social movement. He is the Head of Partnerships for Neon Picturehouse, and Executive Producer & Vice-Chairman of HF Productions. He serves as an Advisor of Think Film, Global Environment Media, Screen South, SIE Society, and Treun House Atelier. Benn also consults on projects from producing Netflix impact campaigns (“Don’t Look Up”, “Breaking Boundaries…), Sony’s Picture This, and SDGs in Action with UN DESA as part of the High Level Political Forum.",
                "names": "Benn Wiebe",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 20:30:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "From Makerspace to Outer Space",
                "published_description": "Going for a job in the space industry may seem like a moonshot but it's actually much closer than most people think - and a makerspace is a great place to start from. \r\n\r\nI now work in the space industry but began my journey into engineering just six years ago by joining a makerspace. Using examples from my own experience - plus some history - I’ll examine how the skills you can pick up as a maker translate over to the space sector, how there are plenty of similarities between hobbyist making and professional space engineering, and how Makerspaces teach skills that are actually in great demand in professional engineering!\r\n\r\nWhere there isn't a direct link from makerspaces into professional work, I'd like to go briefly into what skills you should look to pick up, and how to do it, if want you to go for a space job!",
                "names": "Neil Monteiro",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Influence policing: a view from the cockpit of UK law enforcement’s domestic digital influence campaigns",
                "published_description": "Critical research on digital influence and micro targeting has generally focused on privacy violations by commercial marketers and Cambridge Analytica-style political manipulation. But increasingly, the UK government, police, and security services are using these tools for public policy. The targeted advertising and influence platforms give public sector actors complex tools with which to target behaviour change communications - allowing them to tailor nudge messages based on online behaviour, interests, and fine-detail location. This is allowing the police to use targeted behaviour change advertising to attempt to prevent crime before it happens - but poses serious questions for accountability, ethics, and privacy.\r\n\r\nDrawing on a dataset of more than 12,000 government adverts from the Meta Ad Library and in-depth interviews with law enforcement, we map the landscape of what we call 'influence policing' in the UK, and discuss the ethical and democratic implications of this new mode of policing.",
                "names": "Ben Collier",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 13:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "CERN Technology: Following the White Rabbit down a 27km hole.",
                "published_description": "How does the most complicated machine in the world work? Why should we pay 16 billion euros to keep some physicists happy with a new toy? What has CERN ever done for us? What happens when you lose control of a beam the size of spaghetti with the energy of a full express train?\r\n\r\nThis talk, delivered by a beam instrumentation engineer at CERN, will introduce CERN and it's accelerator complex, and discuss the technology required to deliver one petabyte of cutting-edge science per day to over 170 research facilities in 36 countries. The talk will also cover some of CERN's open source software and hardware contributions to date, and finally explore their science and technology roadmap for the coming years.",
                "names": "Laurence Stant",
                "pronouns": "he/his",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 13:00:00",
                "scheduled_duration": 50,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Magic Your Mind Happy",
                "published_description": "Delve into the secret world of wizardry with psychologist and Member of the Inner Magic Circle Professor Richard Wiseman. He reveals how learning magic tricks can boost your confidence, social skills, creativity, happiness and much, much more. Experience the world’s greatest optical illusions, have fun discovering how to perform magic, uncover the secret science of sorcery, and find out how to transform a tea towel into a chicken!",
                "names": "richard wiseman",
                "pronouns": "his/he",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-06-01 15:40:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Explosion in a Tunnel; Understanding Swiss Cheese",
                "published_description": "The talk takes a deep-dive into the Abbeystead explosion (using pretty much all available sources available on the subject), one of the worst civil engineering disasters in post-war history, through the lens of the HSE investigation.  It looks at what the project was for, how it was designed, what went wrong, and why.  Swiss cheese is a way of conceptualizing accidents, and the explosion is used so show how this works.  Hopefully by the end, everyone will have heard about a facinating case study in bad project management, weird critical infrastructure, and have recieved a safety talk by stealth.",
                "names": "Oliver Trojak",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 15:40:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Astrophotography on a budget",
                "published_description": "I'll cover what you can do with a limited budget; lenses and cameras you already own (your phone for example); and what you might expect to see. I'm not a professional, or even a very talented amateur, but tenacity and the willing to sit out in the dark and get eaten by mosquitoes, growled at by foxes and frozen in the winter does sometimes pay off. \r\n\r\nI've been taking pictures of the sky and things in it on and off for over 30 years. I started with a cheap Tasco telescope from a catalog company and a 110 film camera glued to the eyepiece - it didn't work well (if at all), but it got me hooked. ",
                "names": "David Mills",
                "pronouns": "He / Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 18:50:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Furry 101: A Byte-Sized Introduction",
                "published_description": "This presentation serves as an introductory exploration into the furry fandom, a subculture centered around anthropomorphic animal characters. We will outline the creation and role of 'fursonas', discuss the community's artistic expressions including digital art and fursuiting, and examine the integration of these elements with modern digital media. The session aims to clarify common misconceptions, providing a concise overview of the furry fandom's cultural and social aspects, tailored for those new to or curious about this diverse community.",
                "names": "Scorcher",
                "pronouns": "",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-05-31 12:00:00",
                "scheduled_duration": 30,
                "venue": "Workshop 3 (Furry High Commission)",
                "venue_village_id": 39
            },
            {
                "published_title": "From Tax Law to Tangible Dreams: An Accidental Maker's Journey",
                "published_description": "I was trained as a tax lawyer and data scientist as a profession but I always wanted to build. I attended the my first EMF and was hugely inspired by the participants and presenters I met. \r\n\r\nThe following year, with the support of an EU innovation grant, I embarked on a 6-month product design course, culminating in an interactive children's book inspired by the Art of War. This unique book blends storytelling with 3D paper origami, touch sensors, cloud-based audio features, making ancient wisdom fun and engaging for young minds. In my talk, I'll share the challenges and triumphs of this unexpected adventure, from design principles to prototyping hurdles, offering valuable insights for aspiring makers and seasoned professionals alike.",
                "names": "Shan Sun",
                "pronouns": "She/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 10:00:00",
                "scheduled_duration": 20,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Does Robot Wars have a Meta? ",
                "published_description": "Robot Wars is a TV show that inspired a generation of engineers to take up the sport of \"Robot Combat\", but what drove success in the design of those competing? \r\n\r\nLooking at some famous matches and designs, this talk will break down the rock-paper-scissors of the sport, and try to provide an understanding of how this can help to educate a new generation of engineers today. \r\n\r\nShould the sport have a Meta, it will mean certain designs always win out over others - however should it not, then it may suggest it is not the design itself that determines success, but rather ones understanding of design.  ",
                "names": "Gareth Anstee",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-02 15:30:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Keeping shell history in sync with turtles and magic",
                "published_description": "Atuin is a command line tool for searching and synchronizing shell history across devices. \r\n\r\nI'll be telling the story of how I accidentally made a popular open source project, diving in to how it synchronizes and encrypts data, and covering some of the lessons learned from working in public\r\n\r\nFor disclosure; I currently work on Atuin, which is what this talk is about. ",
                "names": "Ellie Huxtable",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 14:00:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Making sense of London Underground's timetables and real-time data",
                "published_description": "Building on a talk by eta from EMF 2022, this is a deeper dive into how to make use of London Underground's real-time data and hard-to-access timetables to predict a train's future actions.\r\n\r\nI will be going into depth on what is and isn't useful about TfL's APIs, the major differences between the operations of LU and National Rail operators, why it's so difficult to obtain LU timetables in a useful format, and why it's even more difficult to apply real-time data to them.",
                "names": "Arturs Dobrecovs",
                "pronouns": "He/They",
                "may_record": false,
                "video_privacy": "review",
                "scheduled_time": "2024-06-02 11:10:00",
                "scheduled_duration": 30,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "An Evening of Unnecessary Detail",
                "published_description": "”An Evening of Unnecessary Detail” is an event where we ask enthusiasts, scientists, and/or comedians to talk about whatever they want. By attending this event, you revoke all rights to complain about the level of detail they choose to do so in.",
                "names": "Matt Parker & Guests",
                "pronouns": "he/him",
                "may_record": false,
                "video_privacy": "none",
                "scheduled_time": "2024-06-01 19:30:00",
                "scheduled_duration": 60,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Is everything difficult, or is it just me?",
                "published_description": "It isn't just you.\r\n\r\nThere are so many pressures on us, not only from our jobs and industry, but from the state of society, politics and the economy as a whole.\r\n\r\nJoin me on a joyful journey through the alphabet of overwhelm, we’ll cover Anxiety, Burnout, Capitalism, Depression, Emotional Labour and many other fun factors. We’ll talk through how to recognise symptoms in yourself and your friends. Lets learn how to survive, and hopefully thrive, in this ABSea of sh*t.\r\n",
                "names": "Jo Franchetti",
                "pronouns": "she/her",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 18:40:00",
                "scheduled_duration": 40,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "How we make videogames",
                "published_description": "I am the creative director and programmer at Hollow Ponds, a videogame development studio. I'm going to briefly show some of our earlier games for context, and then talk about a number of interesting things about the development of our forthcoming game FLOCK - a multiplayer game about exploring a big wild landscape on the back of a giant bird, seeking out strange creatures, and charming them into a big flock.",
                "names": "Ricky Haggett",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 16:30:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "EveryWhere, a regenerative mesh network for communities",
                "published_description": "EveryWhere is an open source system for creating mesh networks to allow communities to connect with themselves without having to use commercial systems to do so. Inspired by David Graeber's idea of the sustainable activities of play and care, EveryWhere aims to make new rituals around technology that allow the network to exist across generations. In 2022 we convened a group of artists, technologists, designers and activists to start the project. As result of the connections made, we have identified themes and ideas that we will present in this talk. The five themes are Community, Sustainability, Software, Hardware and Creative. Within each of these themes, we've identified four main areas of concern. The purpose of this talk would be to relate our progress up to this point and to galvanise further collaboration with the EMF community. We are a pair of artistic researchers and creative technologists and we care!",
                "names": "Joel Gethin Lewis",
                "pronouns": "He/Him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 18:10:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Tiny Whooping A Circus Tent",
                "published_description": "This is a workshop by London Aerospace Village\r\nMiniscule FPV racing drones flying round one of the big tents\r\nSmall and safe enough to lose a fight with a party balloon or your face\r\nFast and aerobatic enough to be entertaining (between crashes too!)\r\nCome and watch along with the drones-eye views on the big screens\r\nBring and fly** your own if you have one*\r\n\r\nDISCLAIMER: There are lots of 2.4GHz and 5.8GHz radio sources on site. The workshop organisers control very few of them. There will be interference, it may be unflyable. It can still be a friendly meetup!\r\n\r\n*to fly inside the tent all drones;\r\nMUST comply with;\r\n-max 5V batteries (1S)\r\n-max 50g AUW\r\n-max dia80mm PCD motor spacing\r\n-max dia35mm prop sizes\r\n-prop guards\r\n-max 25mW 5.8GHz FPV (R1/R3/R7/R8)\r\n\r\nis RECOMMENDED to use;\r\n-analogue or HDZero, to easily be displayed on the screens\r\n-addressable RGB LEDs for easy identification\r\n-ELRS 2.4GHz Tx/Rx***\r\n\r\nis PERMITTED to use;\r\n-Walksnail or DJI HD FPV, but as their goggles also transmit you must only power up the drone *or the goggles* as the workshop organiser directs and we may have to distance these pilots a bit further apart\r\n-Other DJI protocols or other FPV projects like Connex, OpenHD, RubyFPV, OpenIPC, WFB-NG, but you must still only power up as directed by the workshop organiser as they still use the same busy radio bandwidth \r\n-Any other control systems such as FrSky, Spektrum, FlySky etc***\r\n\r\n**during the workshop, 5.8GHz transmitters (drone VTx's / HD goggles) must only be powered on as permitted by the workshop organiser\r\n***All radio control systems are welcome but older whoop-size receivers may not be as robust in the harsh RF environment of a whoop meet within the harsh RF environment of EMFcamp",
                "names": "Andrew Hyams",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 20:40:00",
                "scheduled_duration": 120,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Connecting Arduinos to websites: A sequence of chaotic live demos",
                "published_description": "Controlling websites with an Arduino is like magic. Suddenly little bits of hardware can control all kinds of games and interfaces on screens. And building a UI for your electronics becomes trivial too.\r\n\r\nThis is a talk for anyone who’s ever tinkered with hardware or web design, and wants to join the physical to the digital. \r\n\r\nDuring this talk I will explain the basic techniques of keyboard emulation and using the Javascript Web Serial and Web Bluetooth APIs. To make it fun, and introduce some peril, I will demo all of the techniques live: controlling the Google Chrome Dino game by jumping up and down on stage, making a musical instrument from stretchy rubber and allowing audience members to connect to a set of handbells from their phones.\r\n\r\nAlong the way will be plenty of tips on what to buy and what to avoid, I’ll demystify some of the complexity around Bluetooth and USB, and share several ideas for how to use this to cause mischief amongst friends, colleagues and enemies.\r\n\r\nI have done this before, but only once. Fingers crossed.",
                "names": "George Cave",
                "pronouns": "he/him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 10:40:00",
                "scheduled_duration": 20,
                "venue": "Stage B",
                "venue_village_id": null
            },
            {
                "published_title": "Cobwebs, snowflakes and crows' feet",
                "published_description": "The bicycle wheel is quite possibly the best thing humans have ever invented.\r\nBut then, I would say that - I build them for a living. Come along for a quick ride through their creation, evolution and revolution, a detour through some weird and wonderful designs and maybe a look at what a high-tech future holds for this deceptively simple structure.",
                "names": "Pete Owen",
                "pronouns": "he / him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 17:30:00",
                "scheduled_duration": 30,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Lightning talks  (Saturday)",
                "published_description": "Short 10 minute talks on any topic",
                "names": "Thor",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-06-01 12:30:00",
                "scheduled_duration": 40,
                "venue": "Stage C",
                "venue_village_id": null
            },
            {
                "published_title": "Opening Ceremony",
                "published_description": "The ceremony in which we open the festival. Hello!",
                "names": "EMF Team",
                "pronouns": "",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 10:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "Coding Beyond the Screen: The unique challenges of programming massive public laser displays",
                "published_description": "Join BAFTA winning digital artist Seb Lee-Delisle in this engaging talk about his life and work over the past few years. \r\n\r\nAlthough Seb is known for his large and spectacular outdoor light and laser shows, he is fundamentally a coder. In this fun keynote, he’ll talk about the unique challenges of working with computers at this scale, and demonstrate how to code mesmerising particle effects with an actual laser. ",
                "names": "Seb Lee-Delisle",
                "pronouns": "He / him",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 18:00:00",
                "scheduled_duration": 30,
                "venue": "Stage A",
                "venue_village_id": null
            },
            {
                "published_title": "The Best Word In Morse Code",
                "published_description": "After accidentally becoming fluent in Morse Code I have waded through a sea of dots and dashes to find THE best word in Morse Code (ok, maybe its just my personal favourite - but I have reasons to back it up!)\r\nOf course, as a mathematician, I couldn't leave it there and have also determined what I believe to be the best number in Morse Code too.\r\nFrom steganography to lexical anomalies we explore the delights of this not exactly binary alphabet.\r\nYou may not have time to learn all of Morse Code, so come and learn the singular most awesome word in Morse instead!",
                "names": "Ayliean Macdonald",
                "pronouns": "any/all",
                "may_record": true,
                "video_privacy": "public",
                "scheduled_time": "2024-05-31 15:20:00",
                "scheduled_duration": 20,
                "venue": "Stage A",
                "venue_village_id": null
            }
        ],
        "counts": {
            "needs_help": {
                "false": 243,
                "true": 57
            },
            "needs_money": {
                "false": 300
            },
            "needs_laptop": {
                "false": 278,
                "true": 8,
                "null": 14
            },
            "one_day": {
                "false": 300
            },
            "notice_required": {
                "1 month": 258,
                "1 week": 1,
                "> 1 month": 25,
                "> 3 months": 3,
                "null": 13
            },
            "may_record": {
                "false": 169,
                "true": 117,
                "null": 14
            },
            "video_privacy": {
                "none": 161,
                "public": 115,
                "review": 10,
                "null": 14
            },
            "state": {
                "finalised": 142,
                "manual-review": 2,
                "new": 1,
                "rejected": 112,
                "withdrawn": 43
            },
            "created_week": {
                "2024-01-29": 32,
                "2024-02-05": 32,
                "2024-02-12": 27,
                "2024-02-19": 35,
                "2024-02-26": 22,
                "2024-03-04": 10,
                "2024-03-11": 7,
                "2024-03-18": 10,
                "2024-03-25": 21,
                "2024-04-01": 10,
                "2024-04-08": 13,
                "2024-04-15": 14,
                "2024-04-22": 41,
                "2024-04-29": 9,
                "2024-05-06": 2,
                "2024-05-20": 5,
                "2024-05-27": 10
            }
        },
        "edits": {
            "published_title": {
                "avg": "1.69",
                "max": 6
            },
            "published_description": {
                "avg": "1.84",
                "max": 6
            },
            "length": {
                "avg": "1.04",
                "max": 4
            },
            "equipment_required": {
                "avg": "1.34",
                "max": 4
            },
            "funding_required": {
                "avg": "1.19",
                "max": 3
            },
            "additional_info": {
                "avg": "1.33",
                "max": 4
            },
            "notice_required": {
                "avg": "1.01",
                "max": 2
            },
            "needs_help": {
                "avg": "1.03",
                "max": 2
            },
            "needs_money": {
                "avg": "1.00",
                "max": 1
            },
            "one_day": {
                "avg": "1.00",
                "max": 1
            },
            "has_rejected_email": {
                "avg": "1.33",
                "max": 2
            },
            "published_names": {
                "avg": "1.66",
                "max": 4
            },
            "published_pronouns": {
                "avg": "1.60",
                "max": 4
            },
            "arrival_period": {
                "avg": "1.64",
                "max": 4
            },
            "departure_period": {
                "avg": "1.63",
                "max": 4
            },
            "eventphone_number": {
                "avg": "1.47",
                "max": 4
            },
            "telephone_number": {
                "avg": "1.60",
                "max": 4
            },
            "may_record": {
                "avg": "2.32",
                "max": 4
            },
            "video_privacy": {
                "avg": "1.40",
                "max": 4
            },
            "needs_laptop": {
                "avg": "1.94",
                "max": 3
            },
            "available_times": {
                "avg": "1.75",
                "max": 5
            },
            "attendees": {
                "avg": "1.00",
                "max": 2
            },
            "cost": {
                "avg": "1.00",
                "max": 2
            },
            "size": {
                "avg": "1.00",
                "max": 1
            },
            "installation_funding": {
                "avg": "1.00",
                "max": 1
            },
            "age_range": {
                "avg": "1.01",
                "max": 2
            },
            "participant_equipment": {
                "avg": "1.01",
                "max": 2
            }
        }
    }
}